Repository: nabetaro/elinks
Catalog: po/*.po
Languages: ru

source: Close
ru: Закрыть

source: Info
ru: Информация

source: Press space to expand this folder.
ru: Нажмите на клавишу "Пробел", чтобы развернуть эту папку

source: Sorry, but the item "%s" cannot be deleted.
ru: Невозможно удалить элемент "%s".

source: Sorry, but the item "%s" is being used by something else.
ru: Элемент "%s" в данный момент используется.

source: Sorry, but the folder "%s" cannot be deleted.
ru: Невозможно удалить папку "%s".

source: Sorry, but the folder "%s" is being used by something else.
ru: Папка "%s" в данный момент используется.

source: Delete marked items
ru: Удаление отмеченных элементов

source: Delete marked items?
ru: Удалить отмеченные элементы?

source: Delete folder
ru: Удаление папки

source: Delete the folder "%s" and its content?
ru: Удалить папку "%s" вместе с содержимым?

source: Delete item
ru: Удаление элемента

source: Delete "%s"? %s
ru: Удалить "%s"? %s

source: Clear all items
ru: Удаление всех элементов

source: Do you really want to remove all items?
ru: Удалить все элементы?

source: Delete error
ru: Ошибка удаления

source: ~Yes
ru: ~Да

source: ~No
ru: ~Нет

source: Search
ru: Поиск

source: Search string '%s' not found
ru: Строка поиска "%s" не найдена

source: Name
ru: Имя

source: Bad number
ru: Недопустимое число

source: Number expected in field
ru: Поле должно содержать число

source: Number should be in the range from %d to %d.
ru: Число должно быть в диапазоне от %d до %d.

source: Bad string
ru: Недопустимая строка

source: Empty string not allowed
ru: Пустые строки не допускаются

source: ~Cancel
ru: ~Отмена

source: Clock
ru: Часы

source: Digital clock in the status bar.
ru: Цифровые часы в строке состояния.

source: Enable
ru: Активировать

source: Whether to display a digital clock in the status bar.
ru: Отображать цифровые часы в строке состояния.

source: Format
ru: Формат

source: Format string for the digital clock. See the strftime(3) manpage for details.
ru: Форматирование строки цифровых часов. Смотри подробное описание в руководстве strftime(3).

source: LEDs
ru: Индикаторы

source: LEDs (visual indicators) options.
ru: Параметры индикаторов (индикаторных ламп).

source: Enable LEDs. These visual indicators will inform you about various states.
ru: Активировать индикаторы. Эти световые индикаторы предоставляют информацию о различных состояниях.

source: LED indicators
ru: Световые индикаторы

source: What the different LEDs indicate: [SIJP--] |||||`- Unused ||||`-- Unused |||`--- A JavaScript pop-up window was blocked ||`---- A JavaScript error has occurred |`----- The state of insert mode for text-input form-fields | 'i' means modeless, 'I' means insert mode is on `------ Whether an SSL connection was used '-' generally indicates that the LED is off.
ru: Назначение различных световых индикаторов: [SIJP--] |||||`- Не используется ||||`-- Не используется |||`--- Заблокировано всплывающее окно JavaScript ||`---- Произошла ошибка JavaScript |`----- Состояние режима ввода для текстовых полей формы | "i" ? режима ввода выключен, "I" ? режима ввода включен `------ Использование SSL-соединения "-" обычно указывает на то, что индикатор отключен.

source: Search menu/
ru: Меню поиска/

source: read_bookmarks_xbel(): Error in XML_ParserCreate()
ru: read_bookmarks_xbel(): Ошибка в XML_ParserCreate()

source: read_bookmarks_xbel(): Error reading %s
ru: read_bookmarks_xbel(): Ошибка чтения %s

source: Parse error while processing XBEL bookmarks in %s at line %d column %d: %s
ru: Ошибка разбора при обработке закладок XBEL в %s на строке %d в столбце %d: %s

source: No title
ru: Без заголовка

source: No URL
ru: Без URL-адреса

source: Bookmarks
ru: Закладки

source: Bookmark options.
ru: Параметры закладок.

source: File format
ru: Формат файла

source: File format for bookmarks (affects both reading and saving): 0 is the default native ELinks format 1 is XBEL universal XML bookmarks format
ru: Формат файла для закладок (влияет как на чтение, так и на сохранение): 0 формат закладок ELinks по умолчанию 1 универсальный формат XML-закладок XBEL

source: File format for bookmarks (affects both reading and saving): 0 is the default native ELinks format 1 is XBEL universal XML bookmarks format (DISABLED)
ru: Формат файла для закладок (влияет как на чтение, так и на сохранение): 0 формат закладок ELinks по умолчанию 1 универсальный формат XML-закладок XBEL (ОТКЛЮЧЕНО)

source: Save folder state
ru: Сохранять состояние папки

source: When saving bookmarks also store whether folders are expanded or not, so the look of the bookmark dialog is kept across ELinks sessions. If disabled all folders will appear unexpanded next time ELinks is run.
ru: При сохранении закладок также сохраняется свёрнутое или развёрнутое состояние папок, чтобы внешний вид диалогового окна закладок сохранялся во всех сеансах ELinks. В случае отключения параметра, при следующем запуске ELinks папки будут свёрнуты.

source: Periodic snapshotting
ru: Периодическое сохранение вкладок

source: Automatically save a snapshot of all tabs periodically. This will periodically bookmark the tabs of each terminal in a separate folder for recovery after a crash. This feature requires bookmark support.
ru: Автоматически сохранять состояние всех вкладок в заданные временные интервалы. Для этого вкладки на каждом терминале будут периодически сохраняться в отдельной папке в виде закладок для восстановления после сбоя. Для работы в этом режиме необходимо включить поддержку закладок.

source: Title
ru: Заголовок

source: URL
ru: URL-адрес

source: Sorry, but the bookmark "%s" cannot be deleted.
ru: Не удалось удалить закладку "%s".

source: Sorry, but the bookmark "%s" is being used by something else.
ru: Закладка "%s" в данный момент используется.

source: Delete marked bookmarks
ru: Удаление отмеченных закладок

source: Delete marked bookmarks?
ru: Удалить отмеченные закладки?

source: Delete the folder "%s" and all bookmarks in it?
ru: Удалить папку "%s" и все содержащиеся в ней закладки?

source: Delete bookmark
ru: Удаление закладки

source: Delete this bookmark?
ru: Удалить эту закладку?

source: Clear all bookmarks
ru: Удаление всех закладок

source: Do you really want to remove all bookmarks?
ru: Удалить все закладки?

source: Add folder
ru: Создание папки

source: Folder name
ru: Имя папки

source: Edit bookmark
ru: Изменение закладки

source: Cannot move folder inside itself
ru: Невозможно переместить папку в саму себя

source: You are trying to move the marked folder inside itself. To move the folder to a different location select the new location before pressing the Move button.
ru: Произошла попытка перемещения отмеченной папки в саму себя. Для перемещения папки в другое место необходимо выбрать новое расположение прежде нажатия кнопки ?Переместить?.

source: Nothing to move
ru: Объект перемещения отсутствует

source: To move bookmarks, first mark all the bookmarks (or folders) you want to move. This can be done with the Insert key if you're using the default key-bindings. An asterisk will appear near all marked bookmarks. Now move to where you want to have the stuff moved to, and press the "Move" button.
ru: Для перемещения закладок сначала нужно отметить все закладки (или папки), которые предполагается переместить. Это можно сделать с помощью клавиши Insert, если используются сочетания клавиш по умолчанию. Рядом с отмеченными закладками появляется звёздочка. Затем необходимо перейти в то место, куда предполагается выполнить перемещение и нажать кнопку ?Переместить?.

source: ~Goto
ru: ~Перейти

source: ~Edit
ru: ~Изменить

source: ~Delete
ru: ~Удалить

source: ~Add
ru: ~Добавить

source: Add se~parator
ru: До~бавить разделитель

source: Add ~folder
ru: Доба~вить папку

source: ~Move
ru: Пе~реместить

source: ~Search
ru: П~оиск

source: Clear
ru: Очистить

source: Save
ru: Сохранить

source: Bookmark manager
ru: Диспетчер закладок

source: Search bookmarks
ru: Искать в закладках

source: Add bookmark
ru: Добавить закладку

source: Saved session
ru: Сеанс сохранён

source: Bookmark tabs
ru: Сохранить вкладки в закладках

source: Enter folder name
ru: Введите имя папки

source: Proxy URL
ru: URL-адрес прокси-сервера

source: Redirect
ru: Перенаправление

source: Size
ru: Размер

source: Loaded size
ru: Загруженные размер

source: Content type
ru: Тип содержимого

source: Last modified
ru: Последнее изменение

source: SSL Cipher
ru: Шифр SSL

source: Encoding
ru: Кодировка

source: Flags
ru: Флаги

source: incomplete
ru: неполные

source: invalid
ru: недопустимые

source: Expires
ru: Истекает

source: ID
ru: ИД

source: Header
ru: Заголовок

source: Sorry, but cache entry "%s" cannot be deleted.
ru: Невозможно удалить запись кэша "%s".

source: Sorry, but cache entry "%s" is being used by something else.
ru: Запись кэша "%s" в данный момент используется.

source: Delete marked cache entries
ru: Удаление отмеченных записей кэша

source: Delete marked cache entries?
ru: Удалить отмеченные записи кэша?

source: Delete cache entry
ru: Удаление записи кэша

source: Delete this cache entry?
ru: Удалить эту запись кэша?

source: ~Info
ru: ~Информация

source: Cache manager
ru: Диспетчер кэша

source: Do nothing
ru: Не совершать никаких действий

source: Attempt to auto-complete the input
ru: Пытаться выполнить автозавершение ввода

source: Attempt to auto-complete a local file
ru: Пытаться выполнить автозавершение локального файла

source: Attempt to unambiguously auto-complete the input
ru: Пытаться выполнить однозначное автозавершение ввода

source: Delete character in front of the cursor
ru: Удалить символ перед курсором

source: Go to the first line of the buffer
ru: Перейти к первой строке буфера

source: Cancel current state
ru: Отменить текущее состояние

source: Copy text to clipboard
ru: Копировать текст в буфер обмена

source: Cut text to clipboard
ru: Вырезать текст в буфер обмена

source: Delete character under cursor
ru: Удалить символ под курсором

source: Move cursor downwards
ru: Переместить курсор вниз

source: Go to the end of the page/line
ru: Перейти к концу страницы/строки

source: Go to the last line of the buffer
ru: Перейти к последней строке буфера

source: Follow the current link
ru: Перейти по ссылке

source: Go to the start of the page/line
ru: Перейти к началу страницы/строки

source: Delete to beginning of line
ru: Удалить начало строки

source: Delete to end of line
ru: Удалить конец строки

source: Delete backwards to start of word
ru: Выполнить удаление в обратном направлении в сторону начала слова

source: Move the cursor left
ru: Переместить курсор влево

source: Move cursor before current word
ru: Переместить курсор перед текущим словом

source: Move cursor after current word
ru: Переместить курсор после текущего слова

source: Move to the next item
ru: Перейти к следующей записи

source: Open in external editor
ru: Открыть во внешнем редакторе

source: Paste text from the clipboard
ru: Вставить текст из буфера обмена

source: Move to the previous item
ru: Перейти к предыдущему элементу

source: Redraw the terminal
ru: Обновить экран терминала

source: Move the cursor right
ru: Переместить курсор вправо

source: Toggle regex matching (type-ahead searching)
ru: Переключить режим поиска соответствий по регулярному выражению (упреждающий поиск)

source: Move cursor upwards
ru: Переместить курсор вверх

source: Abort connection
ru: Прервать соединение

source: Add a new bookmark
ru: Добавить закладку

source: Add a new bookmark using current link
ru: Добавить текущую ссылку в закладку

source: Bookmark all open tabs
ru: Добавить все вкладки в закладки

source: Open authentication manager
ru: Открыть диспетчер проверки подлинности

source: Backspace the last entered digit of the current prefix
ru: Удалить последнюю введённую цифру текущего префикса

source: Open bookmark manager
ru: Открыть диспетчер закладок

source: Open cache manager
ru: Открыть диспетчер кэша

source: Free unused cache entries
ru: Удалить неиспользуемые записи кэша

source: Open cookie manager
ru: Открыть диспетчер файлов cookie

source: Reload cookies file
ru: Перезагрузить файл cookie

source: Show information about the current page
ru: Показать информацию о текущей странице

source: Open download manager
ru: Открыть диспетчер загрузки

source: Enter ex-mode (command line)
ru: Войти в командный режим (режим командной стоки)

source: Open the File menu
ru: Открыть меню "Файл"

source: Find the next occurrence of the current search text
ru: Найти следующее вхождение искомого текста

source: Find the previous occurrence of the current search text
ru: Найти предыдущее вхождение искомого текста

source: Forget authentication credentials
ru: Удалить учетные данные аутентификации

source: Open form history manager
ru: Открыть диспетчер истории заполнения форм

source: Pass URI of current frame to external command
ru: Передать URI-адрес текущего фрейма внешней команде

source: Maximize the current frame
ru: Распахнуть текущий фрейм

source: Move to the next frame
ru: Перейти к следующему фрейму

source: Move to the previous frame
ru: Перейти к предыдущему фрейму

source: Open "Go to URL" dialog box
ru: Открыть диалоговое окно "Перейти к URL-адресу"

source: Open "Go to URL" dialog box containing the current URL
ru: Открыть диалоговое окно "Перейти к URL-адресу" с текущим URL-адресом

source: Open "Go to URL" dialog box containing the current link URL
ru: Открыть диалоговое окно "Перейти к URL-адресу" с URL-адресом из текущей ссылки

source: Go to the homepage
ru: Перейти к домашней странице

source: Show information about the current page protocol headers
ru: Показать информацию о заголовках протокола текущей страницы

source: Open history manager
ru: Открыть диспетчер истории

source: Return to the previous document in history
ru: Вернуться к предыдущему документу в истории

source: Go forward in history
ru: Перейти к следующему документу в истории

source: Jump to link
ru: Перейти по ссылке

source: Open keybinding manager
ru: Открыть диспетчер сочетаний клавиш

source: Kill all backgrounded connections
ru: Разорвать все фоновые соединения

source: Download the current link
ru: Скачать по ссылке

source: Download the current image
ru: Скачать изображение

source: Attempt to resume download of the current link
ru: Пытаться восстановить загрузку по текущей ссылке

source: Pass URI of current link to external command
ru: Передать URI-адрес текущей ссылки внешней команде

source: Follow the current link, forcing reload of the target
ru: Перейти по ссылке с принудительной перезагрузкой объекта

source: Open the link context menu
ru: Открыть контекстное меню для ссылки

source: Open the form fields menu
ru: Открыть меню полей формы

source: Open a Lua console
ru: Открыть консоль Lua

source: Go at a specified mark
ru: Перейти к указанной отметке

source: Set a mark
ru: Установить отметку

source: Activate the menu
ru: Активировать меню

source: Move cursor down
ru: Переместить курсор вниз

source: Move cursor left
ru: Переместить курсор влево

source: Move cursor to the start of the line
ru: Переместить курсор к началу строки

source: Move cursor right
ru: Переместить курсор вправо

source: Move cursor up
ru: Переместить курсор вверх

source: Move to the end of the document
ru: Перейти к концу документа

source: Move to the start of the document
ru: Перейти к началу документа

source: Move one link down
ru: Перейти на одну ссылку вниз

source: Move to the next line with a link
ru: Перейти на следующую строку со ссылкой

source: Move one link left
ru: Перейти на одну ссылку влево

source: Move one link left or to the previous link
ru: Перейти на одну ссылку влево или к предыдущей ссылке

source: Move to the next link
ru: Перейти к следующей ссылке

source: Move to the previous link
ru: Перейти к предыдущей ссылке

source: Move one link right
ru: Перейти на одну ссылку справа

source: Move one link right or to the next link
ru: Перейти на одну ссылку справа или к следующей ссылке

source: Move one link up
ru: Перейти на одну ссылку выше

source: Move to the previous line with a link
ru: Перейти к предыдущей строке со ссылкой

source: Move downwards by a page
ru: Перейти вниз по странице

source: Move upwards by a page
ru: Перейти вверх по странице

source: Open the current link in a new tab
ru: Открыть ссылку в новой вкладке

source: Open the current link in a new tab in the background
ru: Открыть ссылку в новой фоновой вкладке

source: Open the current link in a new window
ru: Открыть ссылку в новом окне

source: Open a new tab
ru: Открыть новую вкладку

source: Open a new tab in the background
ru: Открыть новую фоновую вкладку

source: Open a new window
ru: Открыть новое окно

source: Open an OS shell
ru: Открыть оболочку ОС

source: Open options manager
ru: Открыть диспетчер настройки параметров

source: Open a quit confirmation dialog box
ru: Открыть диалоговое окно подтверждения завершения работы

source: Quit without confirmation
ru: Завершить работу без подтверждения

source: Reload the current page
ru: Перезагрузить страницу

source: Re-render the current page
ru: Выполнить повторное отображение страницы

source: Reset form items to their initial values
ru: Сбросить элементы формы к начальным значениям

source: Show information about the currently used resources
ru: Показать информацию по используемым ресурсам

source: Save the current document in source form
ru: Сохранить документ в виде исходного кода

source: Save the current document in formatted form
ru: Сохранить текущий документ в форматированном виде

source: Save options
ru: Сохранить параметры

source: Save URL as
ru: Сохранить URL-адрес как

source: Scroll down
ru: Прокрутка вниз

source: Scroll left
ru: Прокрутка влево

source: Scroll right
ru: Прокрутка вправо

source: Scroll up
ru: Прокрутка вверх

source: Search for a text pattern
ru: Поиск шаблона текста

source: Search backwards for a text pattern
ru: Поиск шаблона текста в обратном направлении

source: Search link text by typing ahead
ru: Поиск текста ссылки с упреждением

source: Search document text by typing ahead
ru: Поиск текста документа с упреждением

source: Search document text backwards by typing ahead
ru: Поиск текста документа в обратном направлении с упреждением

source: Show terminal options dialog
ru: Показать диалоговое окно параметров терминала

source: Submit form
ru: Отправить форму

source: Submit form and reload
ru: Отправить форму и перезагрузить страницу

source: Close tab
ru: Закрыть вкладку

source: Close all tabs but the current one
ru: Закрыть все вкладки кроме текущей

source: Pass URI of current tab to external command
ru: Передать URI-адрес текущей вкладки внешней команде

source: Open the tab menu
ru: Открыть меню вкладки

source: Move the current tab to the left
ru: Переместить текущую вкладку влево

source: Move the current tab to the right
ru: Переместить текущую вкладку вправо

source: Next tab
ru: Следующая вкладка

source: Previous tab
ru: Предыдущая вкладка

source: Open the terminal resize dialog
ru: Открыть диалоговое окно изменения размера терминала

source: Toggle rendering of page using CSS
ru: Переключить отображение страницы с использованием CSS

source: Toggle displaying of links to images
ru: Переключить отображение ссылок на изображения

source: Toggle rendering of tables
ru: Переключить отображение таблиц

source: Toggle usage of document specific colors
ru: Переключить использование цветов конкретного документа

source: Toggle rendering page as HTML / plain text
ru: Переключить отображение страницы в виде HTML / простого текста

source: Toggle mouse handling
ru: Переключить возможность использования мыши

source: Toggle displaying of links numbers
ru: Переключить отображение номеров ссылок

source: Toggle plain renderer compression of empty lines
ru: Переключить сжатие пустых строк при отображении страницы в виде простого текста

source: Toggle wrapping of text
ru: Переключить перенос текста

source: View the current image
ru: Просмотреть изображение

source: Expand item
ru: Развернуть элемент

source: Mark item
ru: Отметить элемент

source: Select current highlighted item
ru: Выбрать выделенный элемент

source: Collapse item
ru: Свернуть элемент

source: Cannot parse option %s: %s
ru: Не удалось обработать параметр %s: %s

source: Unknown option %s
ru: Неизвестный параметр %s

source: Parameter expected
ru: Предполагается наличие параметра

source: Too many parameters
ru: Слишком много параметров

source: error
ru: ошибка

source: Host not found
ru: Сервер не найден

source: Resolver error
ru: Ошибка распознавателя

source: Out of memory
ru: Недостаточно памяти

source: Too many arguments
ru: Слишком много параметров

source: Mismatched ending argument quoting
ru: Не совпадает количество кавычек конечного параметра

source: Garbage after quoted argument
ru: Ненужная информация после параметра в кавычках

source: Remote method not supported
ru: Неизвестный удалённый метод

source: Out of memory formatting option documentation
ru: Недостаточно памяти для форматирования документации о параметрах

source: Template option folder
ru: Папка параметров шаблонов

source: (default: %ld)
ru: (по умолчанию: %ld)

source: (default: "%s")
ru: (по умолчанию: "%s")

source: (alias for %s)
ru: (псевдоним для %s)

source: (default: %s)
ru: (по умолчанию: %s)

source: Configuration options
ru: Параметры конфигурации

source: Usage: elinks [OPTION]... [URL]...
ru: Использование: elinks [ПАРАМЕТР]... [URL-адрес]...

source: Options
ru: Параметры

source: Internal consistency error
ru: Сбой внутреннего соответствия

source: Restrict to anonymous mode
ru: Установка ограничений для работы с анонимной учётной записью

source: Restricts ELinks so it can run on an anonymous account. Local file browsing, downloads, and modification of options will be disabled. Execution of viewers is allowed, but entries in the association table can't be added or modified.
ru: Ограничивает возможности ELinks для обеспечения работы с анонимной учётной записью. Отключается возможность просмотра локальных файлов, загрузки файлов и изменения параметров. Разрешается запуск просмотрщиков, но запрещается добавлять или изменять записи в таблице сопоставления.

source: Autosubmit first form
ru: Автоматическая отправка первой формы

source: Automatically submit the first form in the given URLs.
ru: Автоматически отправлять первую форму в данных URL-адресах.

source: Clone internal session with given ID
ru: Клонирование внутреннего сеанса по его идентификатору

source: Used internally when opening ELinks instances in new windows. The ID maps to information that will be used when creating the new instance. You don't want to use it.
ru: Предназначается для внутреннего использования при открытии экземпляров ELinks в новом окне. Идентификатор служит для перенаправления к информации, которая будет использоваться при создании нового экземпляра. Не рекомендуется к применению.

source: Name of directory with configuration file
ru: Имя каталога с конфигурационным файлом

source: Path of the directory ELinks will read and write its config and runtime state files to instead of ~/.elinks. If the path does not begin with a '/' it is assumed to be relative to your HOME directory.
ru: Путь к каталогу ELinks для чтения и записи файлов конфигурации и состояния среды выполнения, замещающий ~/.elinks. Если в начале пути отсутствует символ "/", то предполагается адресация относительно домашнего каталога.

source: Print default configuration file to stdout
ru: Вывод в stdout файла конфигурации по умолчанию

source: Print a configuration file with options set to the built-in defaults to stdout.
ru: Вывод в stdout файла конфигурации с параметрами, установленнымив значения по умолчанию.

source: Name of configuration file
ru: Имя конфигурационного файла
