Repository: nabetaro/elinks
Catalog: po/*.po
Languages: ru

source: The maximum number of peers to request from the tracker. Set to 0 to use the server default.
ru: Максимальное число пиров, запрашиваемое у трекера. При установке значения 0 используются параметры сервера по умолчанию.

source: Minimum peers to skip rerequesting
ru: Минимальное количество пиров для пропуска запроса

source: The minimum number of peers to have in the current peer info pool before skipping requesting of more peers. I.e. setting numwant to zero. Set to 0 to not have any limit.
ru: Минимальное количество пиров в текущем пуле информации о пирах, которое необходимо набрать прежде, чем запрос на большее количество пиров начнёт пропускаться. То есть происходит обнуление параметр numwant. При установке значения 0 ограничение устанавливаться не будет.

source: Peer-wire
ru: Параметры соединения с пирами

source: Lowlevel peer-wire options.
ru: Низкоуровневые параметры соединения с пирами

source: Maximum number of peer connections
ru: Максимальное число соединений с пирами

source: The maximum number of allowed connections to both active and non-active peers. By increasing the number of allowed connections, the chance of finding good peers to download from is increased. However, too many connections can lead to TCP congestion. If the maximum is reached all new incoming connections will be closed.
ru: Максимально допустимое число подключений активных и неактивных пиров. Увеличение числа допустимых подключений увеличивает шансы нахождения хороших пиров для выполнения загрузки. Однако слишком большое количество соединений может привести к перегрузке TCP. При достижении максимального числа все новые входящие соединения будут закрыты.

source: Maximum peer message length
ru: Максимальная длина сообщения пира

source: The maximum length of messages to accept over the wire. Larger values will cause the connection to be dropped.
ru: Максимальная длина принимаемых сообщений. При большем значении соединение будет разорвано.

source: Maximum allowed request length
ru: Максимально допустимая длина запроса

source: The maximum length to allow for incoming requests. Larger requests will cause the connection to be dropped.
ru: Максимально допустимая длина входящего запроса. При большем значении соединение будет разорвано.

source: Length of requests
ru: Длина запросов

source: How many bytes to query for per request. This is complementary to the max_request_length option. If the configured length is bigger than the piece length it will be truncated.
ru: Запрашиваемое число байтов на запрос. Данный параметр дополняет параметр max_request_length. Если заданная длина окажется больше, чем длина части файла, то она будет обрезана.

source: Peer inactivity timeout
ru: Время ожидания активности пира

source: The number of seconds to wait before closing a socket on which nothing has been received or sent.
ru: Число секунд ожидания до закрытия сокета, в течении которых не осуществлялась отправка или получение информации.

source: Maximum peer pool size
ru: Максимальный размер пула пиров

source: Maximum number of items in the peer pool. The peer pool contains information used for establishing connections to new peers. Set to 0 to have unlimited size.
ru: Максимальное число элементов в пуле пиров. Пул пиров содержит информацию, которая используется для установки соединений с новыми пирами. Значение 0 задаёт неограниченный размер пула.

source: Maximum piece cache size
ru: Максимальный размер кэш для части файла

source: The maximum amount of memory used to hold recently downloaded pieces. Set to 0 to have unlimited size.
ru: Максимальный объём памяти, использующийся для недавно загруженных частей файла. Значение 0 задаёт неограниченный размер.

source: Sharing rate
ru: Коэффициент раздачи

source: The minimum sharing rate to achieve before stop seeding. The sharing rate is computed as the number of uploaded bytes divided with the number of downloaded bytes. The value should be a double value between 0.0 and 1.0 both included. Set to 1.0 to atleast upload a complete copy of all data and set to 0.0 to have unlimited sharing rate.
ru: Минимальный коэффициент раздачи после которого раздача может быть прекращена. Коэффициент раздачи вычисляется в виде числа отправленных байтов, делённое на число загруженных байтов. Значение должно представлять собой число с двойной точностью в диапазоне от 0.0 до 1.0, включая оба эти числа. Значение 1.0 устанавливается при необходимости раздачи как минимум одной полной копии всех загруженных данных, а значение 0.0 при неограниченном коэффициенте раздачи.

source: Maximum number of uploads
ru: Максимальное число отдач

source: The maximum number of uploads to allow at once.
ru: Максимальное число отдач одновременно.

source: Minimum number of uploads
ru: Минимальное число отдач

source: The minimum number of uploads which should at least be used for new connections.
ru: Минимальное число отдач, необходимое для подключения новых соединений.

source: Keepalive interval
ru: Интервал для поддержания активности

source: The number of seconds to pause between sending keepalive messages.
ru: Число секунд задержки между отправкой сообщений для поддержания активности.

source: Number of pending requests
ru: Число ожидающих запросов

source: How many piece requests to continuously keep in queue. Pipelining of requests is essential to saturate connections and get a good connection performance and thus a faster download. However, a very big queue size can lead to wasting bandwidth near the end of the connection since remaining piece blocks will be requested from multiple peers.
ru: Постоянное число запросов в очереди на загрузку частей файла. Конвейеризация запросов необходима для заполнения соединений и получения хорошей производительности подключения, а в итоге и более быстрой загрузки данных. Однако большая длина очереди может привести к потере пропускной способности ближе к концу подключения, когда загрузка оставшихся блоков частей файла будет осуществляться от нескольких пиров.

source: Peer snubbing interval
ru: Интервал для обнаружения пренебрегающего пира

source: The number of seconds to wait for file data before assuming the peer has been snubbed.
ru: Число секунд ожидания получения данных, прежде чем пир будет признан пренебрегающим.

source: Peer choke interval
ru: Интервал для определения зависания пира

source: The number of seconds between updating the connection state and most importantly choke and unchoke peer connections. The choke period should be big enough for newly unchoked connections to get started but small enough to not allow freeriders too much room for stealing bandwidth.
ru: Число секунд от обновления состояния соединения до определения зависших и возобновлённых соединений с пирами. Период определения зависания должен быть достаточно продолжительным, чтобы дать восстановиться только что возобновлённым соединениям, но и достаточно мал, чтобы не предоставить слишком много возможностей для кражи трафика.

source: Rarest first piece selection cutoff
ru: Переключение на загрузку наиболее редкой части в первую очередь

source: The number of pieces to obtain before switching piece selection strategy from random to rarest first.
ru: Число частей файла, которые необходимо получить, прежде чем стратегиявыбора части файла для загрузки будет изменена со случайного выбора на выбор наиболее редкой части в первую очередь.

source: Allow blacklisting
ru: Составление чёрного списка

source: Allow blacklisting of buggy peers.
ru: Вести чёрный список проблемных пиров.

source: Warning: potential malicious path detected
ru: Предупреждение: обнаружен потенциально вредоносный путь

source: Info hash
ru: Идентификатор торрента (Info hash)

source: Announce URI
ru: URI-адрес анонса

source: Creation date
ru: Дата создания

source: Directory
ru: Каталог

source: Files
ru: Файлы

source: Comment
ru: Комментарий

source: Download complete: %s
ru: Загрузка завершена: %s

source: Download info
ru: Информация о загрузке

source: downloading (random)
ru: загрузка (случайный выбор)

source: downloading (rarest first)
ru: загрузка (самый редкий в первую очередь)

source: downloading (end game)
ru: загрузка (конец игры)

source: seeding
ru: раздача

source: Status
ru: Статус

source: partial
ru: частично

source: Peers
ru: Пиры

source: %u connection
ru: %u соединение

source: %u seeder
ru: %u сид

source: %u available
ru: %u доступен

source: Swarm info
ru: Информация о рое

source: %u downloader
ru: %u личер

source: Upload
ru: Загрузка

source: average
ru: в среднем

source: 1:1 in
ru: 1:1 за

source: Sharing
ru: Рейтинг

source: uploaded
ru: отдано

source: downloaded
ru: загружено

source: Pieces
ru: Части

source: %u completed
ru: %u завершён

source: %u in progress
ru: %u в процессе

source: %u remaining
ru: %u остаётся

source: Statistics
ru: Статистика

source: %u in memory
ru: %u в памяти

source: %u locked
ru: %u заблокирован

source: %u rejected
ru: %u отклонён

source: %u unavailable
ru: %u недоступен

source: Unable to retrieve %s
ru: Не удалось получить %s

source: What would you like to do with the file '%s'?
ru: Дальнейшие действия с файлом "%s"?

source: Information about the torrent
ru: Информация о торренте

source: What to do?
ru: Дальнейшие действия

source: Down~load
ru: За~грузить

source: ~Display
ru: Ото~бразить

source: Show ~header
ru: Показать ~заголовок

source: Local CGI
ru: Локальный CGI

source: Local CGI specific options.
ru: Параметры локального CGI.

source: Colon separated list of directories, where CGI scripts are stored.
ru: Список папок, разделённых двоеточиями, в которых находятся сценарии CGI.

source: Allow local CGI
ru: Разрешать локальные сценарии CGI

source: Whether to execute local CGI scripts.
ru: Разрешать выполнение локальных сценариев CGI.

source: Local files
ru: Локальные файлы

source: Options specific to local browsing.
ru: Параметры просмотра локальных файлов.

source: Allow reading special files
ru: Разрешать чтение специальных файлов

source: Whether to allow reading from non-regular files. Note this can be dangerous; reading /dev/urandom or /dev/zero can ruin your day!
ru: Разрешать чтение нестандартных файлов. Учтите, что это может быть опасно; чтение файлов /dev/urandom или /dev/zero может привести к серьёзным последствиям!

source: Show hidden files in directory listing
ru: Показывать скрытые файлы при чтении каталога

source: When set to false, files with name starting with a dot will be hidden in local directory listings.
ru: При установке значения false файлы, начинающиеся на точку, будут скрыты при чтении каталога

source: Try encoding extensions
ru: Использовать расширения форматов сжатия

source: When set, if we can't open a file named 'filename', we'll try to open 'filename' with some encoding extension appended (ie. 'filename.gz'); it depends on the supported encodings.
ru: При включении данного параметра, в случае невозможности открытия файла с именем "filename", будет произведена попытка открыть файл"filename" с использованием расширения какого-нибудь формата сжатия(например, "filename.gz"); в зависимости от списка поддерживаемых форматов.

source: File
ru: Файл

source: FSP specific options.
ru: Параметры FSP.

source: Sort entries
ru: Сортировка каталога

source: Whether to sort entries in directory listings.
ru: Сортировать содержимое каталога.

source: FTP specific options.
ru: Параметры FTP.

source: Proxy configuration
ru: Конфигурация прокси-сервера

source: FTP proxy configuration.
ru: Конфигурация прокси-сервера FTP.

source: Host and port-number
ru: Имя сервера и номер порта

source: Host and port-number (host:port) of the FTP proxy, or blank. If it's blank, FTP_PROXY environment variable is checked as well.
ru: Содержит имя сервера и номер порта (сервер:порт) прокси-сервера FTP или пустое значение. Если поле не заполнено, то используется значение переменной среды FTP_PROXY.

source: Anonymous password
ru: Анонимный пароль

source: FTP anonymous password to be sent.
ru: Отправлять анонимный пароль FTP.

source: Use passive mode (IPv4)
ru: Работать в пассивном режиме (IPv4)

source: Use PASV instead of PORT (passive vs active mode, IPv4 only).
ru: Работать в режиме PASV, вместо режима PORT (пассивный и активный режим работы, только с IPv4).

source: Use passive mode (IPv6)
ru: Работать в пассивном режиме (IPv6)

source: Use EPSV instead of EPRT (passive vs active mode, IPv6 only).
ru: Работать в режиме EPSV, вместо режима EPRT (пассивный и активный режим работы, только с IPv6).

source: HTTP error %03d
ru: Ошибка HTTP %03d

source: An error occurred on the server while fetching the document you requested. However, the server did not send back any explanation of what happened, so it is unknown what went wrong. Please contact the web server administrator about this, if you believe that this error should not occur since it is not a nice behaviour from the web server at all and indicates that there is some much deeper problem with the web server software.
ru: При получении затребованного документа на сервере возникла ошибка. Однако никакой информации по данной ситуации от сервера не получено, в связи с чем точная причина проблемы неизвестна. Если ошибка заведомо связана с работой сервера, то необходимо сообщить об этом администратору веб-сервера, поскольку данная ситуация не может являться признаком нормальной работы веб-сервера и говорит о наличии весьма серьёзных проблем с его программным обеспечением.

source: HTTP-specific options.
ru: Параметры HTTP.

source: Server bug workarounds
ru: Обходные пути решения проблем при ошибках сервера

source: Server-side HTTP bugs workarounds.
ru: Обходные пути решения проблем при ошибках протокола HTTP на стороне сервера.

source: Do not send Accept-Charset
ru: Не отправлять "Accept-Charset"

source: The Accept-Charset header is quite long and sending it can trigger bugs in some rarely found servers.
ru: Заголовок "Accept-Charset" имеет значительную длину и отправка его может привести к возникновению ошибок на некоторых немногочисленных серверах.

source: Allow blacklisting of buggy servers.
ru: Вести чёрный список проблемных серверов.

source: Broken 302 redirects
ru: Запрет перенаправления 302

source: Broken 302 redirect (violates RFC but compatible with Netscape). This is a problem for a lot of web discussion boards and the like. If they will do strange things to you, try to play with this.
ru: Запрет перенаправления 302 (нарушает RFC, но совместимо с Netscape). Эта проблема широко обсуждается на многих веб-форумах и в различных сообществах. В случае странного поведения, можно попробовать изменить этот параметр.

source: No keepalive after POST requests
ru: Прекращение поддержки активности после выполнения запроса POST

source: Disable keepalive connection after POST request.
ru: Отключать соединение для поддержки активности после выполнения запроса POST.

source: Use HTTP/1.0
ru: Использовать HTTP/1.0

source: Use HTTP/1.0 protocol instead of HTTP/1.1.
ru: Использовать протокол HTTP/1.0, вместо HTTP/1.1.

source: HTTP proxy configuration.
ru: Конфигурация прокси-сервера HTTP.

source: Host and port-number (host:port) of the HTTP proxy, or blank. If it's blank, HTTP_PROXY environment variable is checked as well.
ru: Содержит имя сервера и номер порта (сервер:порт) прокси-сервера HTTP или пустое значение. Если поле не заполнено, то используется значение переменной среды HTTP_PROXY.

source: Username
ru: Имя пользователя

source: Proxy authentication username.
ru: Имя пользователя для аутентификации на прокси-сервере.

source: Proxy authentication password.
ru: Пароль для аутентификации на прокси-сервере.

source: Referer sending
ru: Отправка заголовка Referer

source: HTTP referer sending options. HTTP referer is a special header sent in the HTTP requests, which is supposed to contain the previous page visited by the browser.This way, the server can know what link did you follow when accessing that page. However, this behaviour can unfortunately considerably affect privacy and can lead even to a security problem on some badly designed web pages.
ru: Параметры отправки HTTP-заголовка "referer". Это специальный HTTP-заголовок, отправляемый в HTTP-запросах, который содержитадрес предыдущей страницы, просматривавшейся в браузере. Этот заголовок позволяет серверу определить ссылку, по которой пользователь пришёл на данную страницу. К сожалению, отправка такого заголовка может серьёзно осложнить политику конфиденциальности и даже привести к проблемам безопасности на некоторых неудачно разработанных веб-страницах.

source: Policy
ru: Политика

source: Mode of sending HTTP referer: 0 is send no referer 1 is send current URL as referer 2 is send fixed fake referer 3 is send previous URL as referer (correct, but insecure)
ru: Режим отправки HTTP-заголовка referer: 0 не отправлять "referer" 1 отправлять в заголовке referer текущий URL-адрес 2 отправлять фиксированный фиктивный заголовок "referer" 3 отправлять в заголовке referer предыдущий URL-адрес (правильно, но небезопасно)

source: Fake referer URL
ru: Фиктивный URL-адрес

source: Fake referer to be sent when policy is 2.
ru: Фиктивный заголовок referer отправляется при присвоении параметру политики значения 2.

source: Send Accept-Language header
ru: Отправка заголовка Accept-Language

source: Send Accept-Language header.
ru: Отправка заголовка Accept-Language.

source: Use UI language as Accept-Language
ru: Использовать в заголовке Accept-Language язык пользовательского интерфейса

source: Request localised versions of documents from web-servers (using the Accept-Language header) using the language you have configured for ELinks' user-interface (this also affects navigator.language ECMAScript value available to scripts). Note that some see this as a potential security risk because it tells web-masters and the FBI sniffers about your language preference.
ru: Отправлять веб-серверу запрос на локализованные версии документов (с помощью заголовка Accept-Language), используя язык, который был задан при настройке пользовательского интерфейса ELinks (это также влияет на значение доступного для сценариев параметра navigator.language для ECMAScript). Имейте в виду, что некоторым здесь видится потенциальная угроза безопасности, поскольку предоставляет веб-мастерам и анализаторам трафика ФБР информацию о ваших языковых предпочтениях.

source: Enable on-the-fly compression
ru: Сжатие на лету

source: If enabled, the capability to receive compressed content (gzip and/or bzip2) is announced to the server, which usually sends the reply compressed, thus saving some bandwidth at slight CPU expense. If ELinks displays a incomplete page or garbage, try disabling this option. If that helps, there may be a bug in the decompression part of ELinks. Please report such bugs. If ELinks has been compiled without compression support, this option has no effect. To check the supported features, see Help -> About.
ru: При включении параметра сервер оповещается о наличии у браузера функции обработки сжатого содержимого (gzip и/или bzip2), после чего ответ обычно отправляется уже в сжатом виде. Это способствует экономии пропускной способности за счёт некоторого увеличения нагрузки на ЦП. Если ELinks отображает неполную страницу или мусор, то можно попробовать отключить данный параметр. И если после этого ошибка будет исправлена, то проблема, вероятно, содержится в модуле распаковки ELinks. Обязательно сообщите об обнаружении такой ошибки. Если ELinks был скомпилирован без поддержки сжатия, то данный параметр не будет оказывать никакого влияния на работу. Список поддерживаемых функциональных возможностей программы можно посмотреть в менюСправка -> О программе.

source: Activate HTTP TRACE debugging
ru: Отладка HTTP-методом TRACE

source: If active, all HTTP requests are sent with TRACE as their method rather than GET or POST. This is useful for debugging of both ELinks and various server-side scripts --- the server only returns the client's request back to the client verbatim. Note that this type of request may not be enabled on all servers.
ru: При включении данного параметра все HTTP-запросы отправляются с использованием метода TRACE, вместо GET или POST. Это удобно как для отладки ELinks, так и различных сценариев на стороне сервера, посколькув этом случае сервер всего лишь дословно возвращает запрос клиента. Учтите, что такой тип запроса может поддерживаться не на всех серверах.

source: User-agent identification
ru: Идентификация агента пользователя

source: Change the User Agent ID. That means identification string, which is sent to HTTP server when a document is requested. The 'textmode' token in the first field is our silent attempt to establish this as a standard for new textmode user agents, so that the webmasters can have just a single uniform test for these if they are e.g. pushing some lite version to them automagically. Use " " if you don't want any User-Agent header to be sent at all. %v in the string means ELinks version, %s in the string means system identification, %t in the string means size of the terminal, %b in the string means number of bars displayed by ELinks.
ru: Изменяет идентификатор агента пользователя. Имеется в видуидентификатор, отправляемый HTTP-серверу при запросе документа. Метка "textmode" в первом поле является нашей молчаливой попыткой установить эту строку в качестве стандарта для новых текстовых агентов пользователя, чтобы веб-мастеры могли разрабатывать для них единый унифицированный тест, например, в виде автоматической отправки им облегчённой версии сайта. При вводе значения " " заголовок "User-Agent" отправляться не будет. %v в строке означает версию ELinks, %s в строке означает идентификатор системы, %t в строке означает размер терминала, %b в строке означает число столбцов, отображаемых ELinks.

source: HTTPS-specific options.
ru: Параметры HTTPS.

source: HTTPS proxy configuration.
ru: Конфигурация прокси-сервера HTTPS.

source: Host and port-number (host:port) of the HTTPS CONNECT proxy, or blank. If it's blank, HTTPS_PROXY environment variable is checked as well.
ru: Содержит имя сервера и номер порта (сервер:порт) прокси-сервера HTTPS CONNECT или пустое значение. Если поле не заполнено, то используется значение переменной среды HTTPS_PROXY.

source: NNTP and news specific options.
ru: Параметры NNTP и просмотра новостей.

source: Default news server
ru: Сервер новостей по умолчанию

source: Used when resolving news: URIs. If set to the empty string the value of the NNTPSERVER environment variable will be used.
ru: Используется при получении новостей: URI-адрес. При вводе пустой строки используется значение переменной окружения NNTPSERVER.

source: Message header entries
ru: Поля заголовка сообщения

source: Comma separated list of which entries in the article header to show. E.g. 'Subject' and 'From'. All header entries can be read in the header info dialog.
ru: Список отображаемых полей заголовка, разделённых запятой. Например, "Subject" и "From". Просмотр всех полей заголовка возможен в диалоговом окне "Информация о заголовке".

source: This version of ELinks does not contain %s protocol support
ru: Эта версия ELinks не поддерживает протокол %s

source: Protocols
ru: Протоколы

source: Protocol specific options.
ru: Параметры протоколов.

source: No-proxy domains
ru: Домены без прокси-сервера

source: Comma separated list of domains for which the proxy (HTTP/FTP) should be disabled. Optionally, a port can be specified for some domains as well. If it's blank, NO_PROXY environment variable is checked as well.
ru: Список доменов, разделённых запятой, для которых необходимо отключить загрузку через прокси-сервер (HTTP/FTP). Для некоторых доменов можно дополнительно указать порт. Если данное поле не заполнено, то будет использоваться значение переменной среды NO_PROXY.

source: Protocol
ru: Протокол

source: URI rewriting
ru: Подстановка URI-адресов
