Repository: nabetaro/elinks
Catalog: po/*.po
Languages: ru

source: Bookmarked-link color
ru: Цвет добавленной в закладки ссылки

source: Default bookmarked link color.
ru: Цвет добавленной в закладки ссылки по умолчанию

source: Directory color
ru: Цвет каталога

source: Default directory color. See document.browse.links.color_dirs option.
ru: Цвет каталога по умолчанию. Смотри параметр document.browse.links.color_dirs.

source: Increase contrast
ru: Увеличение контраста

source: Increase the contrast between the foreground and background colors to ensure readability. For example it disallows dark colors on a black background. Note, this is different from ensuring the contrast with the ensure_contrast option.
ru: Увеличение контраста между цветами текста и фона для улучшения удобочитаемости текста. Например, этот параметр запрещает использование тёмных цветов на чёрном фоне. Имейте ввиду, что это отличается от метода повышения контраста с использованием параметра ensure_contrast.

source: Ensure contrast
ru: Повышение контраста

source: Makes sure that the back- and foreground colors are never equal.
ru: Обеспечивает несовпадение цветов текста и фона.

source: Use document-specified colors
ru: Использование заданных в документе цветов

source: Use colors specified in document: 0 is use always the default settings 1 is use document colors if available, except background 2 is use document colors, including background. This can mostly look very impressive, but some sites will appear really ugly. Note, that obviously if the background is not black, it will break the behaviour of transparency.
ru: Использовать цвета, заданные в документе: 0 всегда использовать параметры по умолчанию 1 по возможности использовать цвета документа, исключая цвет фона 2 использовать цвета документа, включая цвет фона. В большинстве случаев, это выглядит впечатляюще, но некоторые сайты будут смотреться крайне неказисто. Также важно отметить, что при отсутствии чёрного фона, будет нарушаться логика применения прозрачности.

source: Downloading
ru: Загрузка

source: Options regarding files downloading and handling.
ru: Параметры загрузки и обработки файлов.

source: Default download directory
ru: Каталог загрузки файлов по умолчанию

source: Default download directory.
ru: Каталог загрузки файлов по умолчанию.

source: Set original time
ru: Установка исходного времени

source: Set the timestamp of each downloaded file to the timestamp stored on the server.
ru: Присвоение метки времени каждому загруженному файлу в соответствии с меткой времени на сервере.

source: Prevent overwriting
ru: Защита от перезаписи файлов

source: Prevent overwriting the local files: 0 is files will silently be overwritten 1 is add a suffix .{number} (for example '.1') to the name 2 is ask the user
ru: Защита локальных файлов от перезаписи: 0 файлы перезаписываются без уведомления 1 к имени файла добавляется суффикс в виде .{номер} (например, ".1") 2 выводится запрос пользователю

source: Notify download completion by bell
ru: Уведомление о завершении загрузки посредством подачи звукового сигнала

source: Audio notification when download is completed: 0 is never 1 is when background notification is active 2 is always
ru: Уведомление о завершении загрузки посредством подачи звукового сигнала: 0 никогда 1 при включении фоновых уведомлений 2 всегда

source: Dump output
ru: Вывод дампа

source: Dump output options.
ru: Параметры вывода дампа.

source: Codepage
ru: Кодовая страница

source: Codepage used in dump output. 'System' stands for a codepage determined by a selected locale.
ru: Кодовая страница, использующаяся при выводе дампа. Параметр "Система" означает, что кодовая страница определяется по текущим настройкам языка системы.

source: Color mode
ru: Цветовой режим

source: Color mode for dumps. Some modes may have been disabled at compile time. The Setup -> Terminal options dialog lists the modes supported by this executable. If you select an unsupported mode, ELinks uses 16 colors. The color modes are: -1 is standard dump mode 0 is mono mode 1 is 16 color mode 2 is 88 color mode 3 is 256 color mode 4 is true color mode
ru: Цветовой режим для дампов. Некоторые режимы могли быть отключены во время компиляции. В диалоговом окне меню "Настройка -> Параметры терминала" перечисляются режимы, которые поддерживаются данным исполняемым файлом. При выборе неподдерживаемого режима, ELinks использует 16 цветов. Можно использовать следующие цветовые режимы: -1 стандартный режим вывода дампа 0 монохромный режим 1 режим 16 цветов 2 режим 88 цветов 3 режим 256 цветов 4 режим "true color"

source: Footer
ru: Нижний колонтитул

source: Footer string used in dumps. %u is substituted by URL.
ru: Использующаяся в дампах строка нижнего колонтитула. Вместо %u подставляется URL-адрес.

source: Header string used in dumps. %u is substituted by URL.
ru: Использующаяся в дампах строка заголовка. Вместо %u подставляется URL-адрес.

source: Numbering
ru: Нумерация

source: Whether to print link numbers in dump output.
ru: Выводить номера ссылок в выводе дампа.

source: References
ru: Ссылки

source: Whether to print references (URIs) of document links in dump output.
ru: Выводить ссылки (URI-адреса ссылок) на документы в выводе дампа.

source: Separator
ru: Разделитель

source: String which separates two dumps.
ru: Строка разделения двух дампов.

source: Width
ru: Ширина

source: Width of screen in characters when dumping documents.
ru: Ширина экрана в символах при создании дампа документов.

source: History
ru: История

source: History options.
ru: Параметры истории.

source: Keep unhistory
ru: Сохранение сведений об обратной истории

source: Keep unhistory ("forward history").
ru: Сохранение сведений об обратной истории ("более поздней истории").

source: HTML rendering
ru: Отображение HTML

source: Options concerning the display of HTML pages.
ru: Параметры, регулирующие отображение страниц HTML.

source: Display frames
ru: Отображение фреймов

source: Display frames.
ru: Отображение фреймов.

source: Display tables
ru: Отображение таблиц

source: Display tables.
ru: Отображение таблиц.

source: Display subscripts
ru: Отображение подстрочного текста

source: Display subscripts (as [thing]).
ru: Отображение подстрочного текста (в виде [текст]).

source: Display superscripts
ru: Отображение надстрочного текста

source: Display superscripts (as ^thing).
ru: Отображение надстрочного текста (в виде ^текст).

source: Rendering of HTML link element
ru: Отображение HTML-элемента "link"

source: How to render <link> tags from the HTML header: 0 is nothing 1 is title 2 is name in addition 3 is hreflang in addition 4 is type in addition 5 is everything
ru: Варианты отображения тэгов <link> из заголовка HTML: 0 не отображать ничего 1 отображать атрибут "title" 2 в дополнение отображать имя 3 в дополнение отображать атрибут "hreflang" 4 в дополнение отображать атрибут "type" 5 отображать всё

source: Underline links
ru: Подчёркивание ссылок

source: Underline links.
ru: Подчёркивание ссылок.

source: Wrap non breaking space
ru: Переносить неразрывный пробел

source: If set do not honour non breaking space (the nbsp entity) but allow to wrap the text. This can help keeping the width of documents down so no horizontal scrolling is needed.
ru: При включении параметра не соблюдается неразрывный пробел (сущность "nbsp"), что позволяет переносить текст. Это сможет помочь выдерживать необходимую ширину документов во избежание необходимости в горизонтальной прокрутке.

source: Plain rendering
ru: Отображение простого текста

source: Options concerning the display of plain text pages.
ru: Параметры для контроля отображения страниц в виде простого текста.

source: Display URIs
ru: Отображение URI-адресов

source: Display URIs in the document as links.
ru: Отображать в документе URI-адреса в виде ссылок.

source: Compress empty lines
ru: Сжатие пустых строк

source: Compress successive empty lines to only one in displayed text.
ru: Сжимать в отображаемом тексте следующие друг за другом пустые строки в одну.

source: URI passing
ru: Передача URI-адреса

source: Rules for passing URIs to external commands. When one rule is defined the link and tab menu will have a menu item that makes it possible to pass the the link, frame or tab URI to an external command. If several rules are defined the link and tab menu will have a submenu of items for each rule. Note, this is mostly useful for launching graphical viewers, since there is no support for releasing the terminal while the command runs. The action and submenus are also available by binding keys to the frame-external-command, the link-external-command, and the tab-external-command actions.
ru: Правила передачи URI-адресов внешним командам. При создании одного правила, в меню ссылок и вкладок добавляется элемент, позволяющий передавать ссылку, фрейм или URI-адрес вкладки внешней команде. При создании нескольких правил в меню ссылок и вкладок добавляется подменю элементов для каждого такого правила. Имейте в виду, что наибольшую пользу эта функция представляет для запуска просмотрщиков графических данных, поскольку разблокировка терминала при работе команды не поддерживается. Доступ к действиям и подменю также можно организовать при назначении клавиш действиям frame-external-command, link-external-command и tab-external-command.

source: A rule for passing URI to an external command. The format is: %c in the string means the current URL %% in the string means '%' Do _not_ put single- or double-quotes around %c.
ru: Правило передачи URI-адреса внешней команде. Формат: %c в строке означает текущий URL-адрес %% в строке означает "%" Ни в коме случае не нужно заключать %c в кавычки.

source: Information files
ru: Информационные файлы

source: Options for information files in ~/.elinks.
ru: Параметры для информационных файлов, находящихся в ~/.elinks.

source: Save interval
ru: Интервал сохранения

source: Interval at which to trigger information files in ~/.elinks to be saved to disk if they have changed (seconds; 0 to disable)
ru: Интервал, с которым выполняется сохранение на диск файлов в ~/.elinks, если они были изменены (секунды; 0 для отмены)

source: Use secure file saving
ru: Безопасное сохранение файлов

source: First write data to unique temporary file, then rename this file upon successfully finishing this. Note that this relates only to config files, not downloaded files. You may want to disable it if you are using some exotic permissions for concerned files. Secure file saving is automagically disabled if file is symlink. Warning: some systems (ie. OS/2, Win32) require that destination file doesn't exist when rename(3) is called, breaking atomicity, and reducing reliability of this feature.
ru: Сначала данные сохраняются в уникальный временный файл, затем после успешного завершения операции файл переименовывается. Имейте в виду, что всё это имеет отношение только к конфигурационным файлам, а не к загружаемым. Необходимость в отключении данной функции может возникнуть при использовании указанных файлов с нестандартными разрешениями. Безопасное сохранение файлов автоматически отключается, если файл окажется символической ссылкой. Предупреждение: некоторые системы (например, OS/2, Win32) требуют отсутствия конечного файла при вызове rename(3), что нарушает атомарность, и снижает надёжность данной функции.

source: Use fsync(3) with secure file saving
ru: Применение функции fsync(3) при безопасном сохранении файлов

source: When using secure file saving, call fsync(3), if the OS supports it, to force the OS immediately to write the data to permanent storage. This is optional for those who wish to avoid excessive disk I/O.
ru: При использовании функции безопасного сохранения файлов, вызовите fsync(3), если ОС поддерживает эту функцию, чтобы заставить ОС выполнить запись данных в постоянное хранилище. Это необязательно для тех, кто предпочитает ограничить количество дисковых операций ввода/вывода.

source: Terminals
ru: Терминалы

source: Terminal options.
ru: Параметры терминала.

source: Options specific to this terminal type (according to $TERM value).
ru: Особые параметры для конкретного типа терминала (в соответствии со значением параметра $TERM).

source: Terminal type; matters mostly only when drawing frames and dialog box borders: 0 is dumb terminal type, ASCII art 1 is VT100, simple but portable 2 is Linux, you get double frames and other goodies 3 is KOI-8 4 is FreeBSD
ru: Тип терминала; имеет значение главным образом только для отображения границ фреймов и диалоговых окон: 0 простой терминал, псевдографика 1 VT100, простой, но переносимый 2 Linux, двойные границы и прочие приятности 3 KOI-8 4 FreeBSD

source: Always encode xterm title in ISO-8859-1
ru: Заголовок xterm всегда в кодировке ISO-8859-1

source: When updating the window title of xterm or a similar terminal emulator, encode the title in ISO-8859-1 (Latin-1), rather than in the charset used for other text in the window. Cyrillic and other characters get replaced with Latin ones. Xterm requires this unless you explicitly enable UTF-8 titles in it. If this option does not take effect immediately, try switching to a different page so that ELinks notices it needs to update the title.
ru: При обновлении заголовка окна xterm или подобного ему эмулятора терминала текст заголовка выводится в кодировке ISO-8859-1 (Latin-1), вместо той кодировки, которая используется для текста в других областях окна. При этом кириллические и прочие подобные символы заменяются латинскими. Данная настройка необходима для работы xterm, пока поддержка заголовков в кодировке UTF-8 не будет явно активирована в нём пользователем. Если параметр не вступает в силу немедленно, попробуйте переключиться на другую страницу, чтобы ELinks быстрее обновил заголовок.

source: Switch fonts for line drawing
ru: Переключение шрифта для рисования линий

source: Switch fonts when drawing lines, enabling both local characters and lines working at the same time. ELinks uses this option only if UTF-8 I/O is disabled and the terminal type is Linux or FreeBSD.
ru: Переключать шрифт для рисования линий, чтобы местные символы и линииможно было использовать одновременно. Этот параметр применяется в ELinks только в том случае, когда ввод/вывод в UTF-8 отключен, а тип терминала - Linux или FreeBSD.

source: UTF-8 I/O
ru: Ввод/вывод в UTF-8

source: Enable I/O in UTF-8 for Unicode terminals. Note that currently, only the subset of UTF-8 according to terminal codepage is used. ELinks ignores this option if the terminal codepage is UTF-8.
ru: Включить ввод/вывод в UTF-8 для терминалов с поддержкой Unicode. Имейте в виду, что на данный момент используется только подмножество UTF-8 кодовой страницы терминала. ELinks игнорирует этот параметр если кодовая страница терминала - UTF-8.

source: Restrict frames in cp850/852
ru: Использовать рамки из cp850/852

source: Restrict the characters used when drawing lines. Makes sense only with linux terminals using the cp850/852 character sets.
ru: Ограничить набор символов для рисования линий. Имеет смысл только для терминалов linux с кодировками cp850/852.

source: Block cursor
ru: Курсор прямоугольником

source: Move cursor to bottom right corner when done drawing. This is particularly useful when we have a block cursor, so that inversed text is displayed correctly.
ru: Перемещать курсор в нижний правый угол после отрисовки экрана, что особенно полезно при использовании прямоугольного курсора для правильного отображения инвертированного текста.

source: The color mode controls what colors are used and how they are output to the terminal. Some modes may have been disabled at compile time. The Setup -> Terminal options dialog lists the modes supported by this executable. If you select an unsupported mode, ELinks uses 16 colors. The color modes are: 0 is mono mode, only 2 colors are used 1 is 16 color mode, uses the common ANSI colors 2 is 88 color mode, uses XTerm RGB codes 3 is 256 color mode, uses XTerm RGB codes 4 is true color mode, uses konsole RGB codes
ru: Цветовой режим контролирует используемые цвета и способ их вывода на терминал. Некоторые режимы могли быть отключены во время компиляции. В диалоговом окне меню "Настройка -> Параметры терминала" перечисляются режимы, которые поддерживаются данным исполняемым файлом. В случае выбора неподдерживаемого режима, ELinks использует 16 цветов. Можно использовать следующие цветовые режимы: 0 монохромный режим, только 2 цвета 1 режим 16 цветов, стандартные цвета ANSI 2 режим 88 цветов, RGB-коды XTerm 3 режим 256 цветов, RGB-коды XTerm 4 режим "true color", RGB-коды konsole

source: Transparency
ru: Прозрачность

source: If we should not set the background to black. This is particularly useful when we have a terminal (typically in some windowing environment) with a background image or a transparent background - it will be visible in ELinks as well (but ELinks document color handling will still assume the background is black so if you have a bright background you might experience contrast problems). Note that this option makes sense only when colors are enabled.
ru: Применяется в ситуации, когда фон не должен быть чёрным. Это особенно полезно при работе в терминале (обычно в какой-либо оконной среде) с фоновым изображением или с прозрачным фоном - всё это будет отображаться и в ELinks (однако при этом цвета документа в ELinks будут выстраиваться в предположении, что цвет фона чёрный, поэтому на светлом фоне могут возникать проблемы с контрастностью). Учтите, что данный параметр имеет смысл только при включенииотображения цветов.

source: If we should use underline or enhance the color instead.
ru: Для выделения текста подчёркиванием или усилением цвета.

source: Codepage of charset used for displaying content on terminal. 'System' stands for a codepage determined by a selected locale.
ru: Кодовая страница, использующаяся при отображении содержимого на терминале. Параметр "Система" означает, что кодовая страница определяется по текущим настройкам языка системы.

source: User interface
ru: Интерфейс пользователя

source: User interface options.
ru: Параметры интерфейса пользователя.

source: Color settings
ru: Настройка цвета

source: Default user interface color settings.
ru: Настройка цвета интерфейса пользователя по умолчанию.

source: Color terminals
ru: Цветные терминалы

source: Color settings for color terminal.
ru: Настройка цвета для цветного терминала.

source: Non-color terminals
ru: Нецветные терминалы

source: Color settings for non-color terminal.
ru: Настройка цвета для нецветного терминала.

source: Main menu bar
ru: Панель главного меню

source: Main menu bar colors.
ru: Цвета панели главного меню.

source: Unselected main menu bar item
ru: Невыделенный элемент панели главного меню

source: Unselected main menu bar item colors.
ru: Цвета невыделенного элемента панели главного меню.

source: Selected main menu bar item
ru: Выделенный элемент панели главного меню

source: Selected main menu bar item colors.
ru: Цвета выделенного элемента панели главного меню

source: Hotkey
ru: Сочетание клавиш

source: Main menu hotkey colors.
ru: Цвета сочетания клавиш главного меню.

source: Unselected hotkey
ru: Невыделенное сочетание клавиш

source: Main menu unselected hotkey colors.
ru: Цвета невыделенного сочетания клавиш главного меню.

source: Selected hotkey
ru: Выделенное сочетание клавиш

source: Main menu selected hotkey colors.
ru: Цвета выделенного сочетания клавиш главного меню.

source: Menu bar
ru: Панель меню

source: Menu bar colors.
ru: Цвета панели меню.

source: Unselected menu item
ru: Невыделенный элемент меню

source: Unselected menu item colors.
ru: Цвета невыделенного элемента меню.

source: Selected menu item
ru: Выделенный элемент меню

source: Selected menu item colors.
ru: Цвета выделенного элемента меню.

source: Marked menu item
ru: Отмеченный элемент меню

source: Marked menu item colors.
ru: Цвета отмеченного элемента меню.

source: Menu item hotkey colors.
ru: Цвета сочетания клавиш элемента меню.

source: Menu item unselected hotkey colors.
ru: Цвета невыделенного сочетания клавиш элемента меню.

source: Menu item selected hotkey colors.
ru: Цвета выделенного сочетания клавиш элемента меню.

source: Menu frame
ru: Рамка меню

source: Menu frame colors.
ru: Цвета рамки меню.

source: Dialog
ru: Диалоговое окно

source: Dialog colors.
ru: Цвета диалогового окна.

source: Generic
ru: Общее поле

source: Generic dialog colors.
ru: Цвета общего поля диалогового окна.

source: Frame
ru: Граница

source: Dialog frame colors.
ru: Цвета границы диалогового окна.

source: Scrollbar
ru: Полоса прокрутки

source: Scrollbar colors.
ru: Цвета полосы прокрутки.

source: Selected scrollbar
ru: Выделенная полоса прокрутки

source: Scrollbar selected colors.
ru: Цвета выделенной полосы прокрутки.

source: Dialog title colors.
ru: Цвета заголовка диалогового окна.

source: Text
ru: Текст

source: Dialog text colors.
ru: Цвета текста диалогового окна.

source: Checkbox
ru: Флажок

source: Dialog checkbox colors.
ru: Цвета флажка диалогового окна.

source: Selected checkbox
ru: Отмеченный флажок

source: Dialog selected checkbox colors.
ru: Цвета отмеченного флажка диалогового окна.

source: Checkbox label
ru: Подпись флажка

source: Dialog checkbox label colors.
ru: Цвета подписи флажка диалогового окна.

source: Button
ru: Кнопка

source: Dialog button colors.
ru: Цвета кнопки диалогового окна.

source: Selected button
ru: Выделенная кнопка

source: Dialog selected button colors.
ru: Цвета выделенной кнопки диалогового окна.

source: Button shortcut
ru: Сочетание клавиш кнопки

source: Selected button shortcut
ru: Сочетание клавиш выделенной кнопки

source: Text field
ru: Текстовое поле

source: Dialog text field colors.
ru: Цвета текстового поля диалогового окна.

source: Text field text
ru: Текст текстового поля

source: Dialog field text colors.
ru: Цвета текстового поля диалогового окна.

source: Meter
ru: Индикатор

source: Dialog meter colors.
ru: Цвета индикатора диалогового окна.

source: Shadow
ru: Тень

source: Dialog shadow colors (see ui.shadows option).
ru: Цвета тени диалогового окна (смотри параметр ui.shadows).

source: Title bar
ru: Заголовок

source: Title bar colors.
ru: Цвета заголовка.

source: Generic title bar
ru: Поле заголовка

source: Generic title bar colors.
ru: Цвета поля заголовка.

source: Title bar text
ru: Текст заголовка

source: Title bar text colors.
ru: Цвета текста заголовка.

source: Status bar
ru: Строка состояния

source: Status bar colors.
ru: Цвета строки состояния.

source: Generic status bar
ru: Поле строки состояния

source: Generic status bar colors.
ru: Цвета поля строки состояния.

source: Status bar text
ru: Текст строки состояния

source: Status bar text colors.
ru: Цвета текста строки состояния.

source: Tabs bar
ru: Панель вкладок

source: Tabs bar colors.
ru: Цвета панели вкладок.

source: Unvisited tab
ru: Непросмотренная вкладка

source: Tab colors for tabs that have not been selected since they completed loading.
ru: Цвета вкладок, которые не просматривались с момента завершения загрузки.

source: Unselected tab
ru: Невыбранная вкладка

source: Unselected tab colors.
ru: Цвета невыбранной вкладки.

source: Loading tab
ru: Загружающаяся вкладка

source: Tab colors for tabs that are loading in the background.
ru: Цвета вкладок, которые загружаются в фоне.

source: Selected tab
ru: Выбранная вкладка

source: Selected tab colors.
ru: Цвета выбранной вкладки.

source: Tab separator
ru: Разделитель вкладок

source: Tab separator colors.
ru: Цвета разделителя вкладок.

source: Searched strings
ru: Строки поиска

source: Searched string highlight colors.
ru: Цвета выделения строки поиска.

source: Dialog settings
ru: Настройка диалогового окна

source: Dialogs-specific appearance and behaviour settings.
ru: Настройка внешнего вида и поведения диалоговых окон
