Repository: nabetaro/elinks
Catalog: po/*.po
Languages: ru

source: A script embedded in the current document was running for more than %d seconds. This probably means there is a bug in the script and it could have halted the whole ELinks, so the script execution was interrupted.
ru: Встроенный сценарий выполнялся более %d секунд. Это может свидетельствовать о наличии ошибки в сценарии, что может привести к зависанию приложения ELinks в целом, в связи с чем выполнение было прервано.

source: JavaScript Alert
ru: Оповещение JavaScript

source: A script embedded in the current document raised the following%s%s%s%s
ru: Сценарий, встроенный в текущий документ, вызвал %s%s%s%s

source: JavaScript Error
ru: Ошибка JavaScript

source: Forms are never saved for this URL.
ru: Формы для этого URL-адреса никогда не сохраняются.

source: Forms are saved for this URL.
ru: Формы для этого URL-адреса сохраняются.

source: Sorry, but form "%s" cannot be deleted.
ru: Не удалось удалить форму "%s".

source: Sorry, but form "%s" is being used by something else.
ru: Форма "%s" в данный момент используется.

source: Delete marked forms
ru: Удаление отмеченных форм

source: Delete marked forms?
ru: Удалить отмеченные формы?

source: Delete form
ru: Удаление формы

source: Delete this form?
ru: Удалить эту форму?

source: Clear all forms
ru: Удаление всех форм

source: Do you really want to remove all forms?
ru: Удалить все формы?

source: Form not saved
ru: Форма не сохранена

source: No saved information for this URL. If you want to save passwords for this URL, enable it by pressing the "Toggle saving" button.
ru: Информация для данного URL-адреса не сохранена. Функцию сохранения паролей для этого URL-адреса можно включить нажатием кнопки "Переключить режим сохранения".

source: ~Login
ru: ~Вход

source: ~Toggle saving
ru: ~Переключить режим сохранения

source: Clea~r
ru: Очис~тить

source: Form history manager
ru: Диспетчер истории заполнения форм

source: Show form history dialog
ru: Выводить диалоговое окно истории заполнения форм

source: Ask if a login form should be saved to file or not. This option only disables the dialog, already saved login forms are unaffected.
ru: Задавать вопрос о допустимости сохранения формы авторизации в файле. Данный параметр только запрещает вывод диалогового окна, сохранённые ранее формы входа остаются без изменения.

source: Form history
ru: История заполнения форм

source: Should this login be remembered? Please note that the password will be stored obscured (but unencrypted) in a file on your disk. If you are using a valuable password, answer NO.
ru: Запомнить эти учётные данные? Пароль будет сохранён в скрытом виде (но без шифрования) в файле на диске. Имейте в виду, что важные пароли лучше не сохранять.

source: Ne~ver for this site
ru: Ник~огда для этого сайта

source: Form History
ru: История заполнения форм

source: Sorry, but history entry "%s" cannot be deleted.
ru: Не удалось удалить запись истории "%s".

source: Sorry, but history entry "%s" is being used by something else.
ru: Запись истории "%s" в данный момент используется.

source: Delete marked history entries
ru: Удаление отмеченных записей истории

source: Delete marked history entries?
ru: Удалить отмеченные записи истории?

source: Delete history entry
ru: Удаление записи истории

source: Delete this history entry?
ru: Удалить эту запись истории?

source: Clear all history entries
ru: Удаление всех записей истории

source: Do you really want to remove all history entries?
ru: Удалить все записи истории?

source: Search history
ru: Искать в истории

source: ~Bookmark
ru: ~Добавить в закладки

source: Global history manager
ru: Диспетчер общей истории

source: Global history
ru: Общая история

source: Global history options.
ru: Параметры общей истории.

source: Enable global history ("history of all pages visited").
ru: Включить общую историю ("историю всех посещённых страниц").

source: Maximum number of entries
ru: Максимальное количество записей

source: Maximum number of entries in the global history.
ru: Максимальное количество записей в общей истории.

source: Display style
ru: Режим отображения

source: What to display in global history dialog: 0 is URLs 1 is page titles
ru: Отображать в диалоговом окне общей истории: 0 URL-адреса 1 заголовки страниц

source: Global History
ru: Общая история

source: System
ru: Система

source: English
ru: Английский

source: Afrikaans
ru: Африкаанс

source: Belarusian
ru: Белорусский

source: Brazilian Portuguese
ru: Португальский (Бразилия)

source: Bulgarian
ru: Болгарский

source: Catalan
ru: Каталанский

source: Croatian
ru: Хорватский

source: Czech
ru: Чешский

source: Danish
ru: Датский

source: Dutch
ru: Нидерландский

source: Estonian
ru: Эстонский

source: Finnish
ru: Финский

source: French
ru: Французский

source: Galician
ru: Галисийский

source: German
ru: Немецкий

source: Greek
ru: Греческий

source: Hungarian
ru: Венгерский

source: Icelandic
ru: Исландский

source: Indonesian
ru: Индонезийский

source: Italian
ru: Итальянский

source: Lithuanian
ru: Литовский

source: Norwegian
ru: Норвежский

source: Polish
ru: Польский

source: Portuguese
ru: Португальский

source: Romanian
ru: Румынский

source: Russian
ru: Русский

source: Serbian
ru: Сербский

source: Slovak
ru: Словацкий

source: Spanish
ru: Испанский

source: Swedish
ru: Шведский

source: Turkish
ru: Турецкий

source: Ukrainian
ru: Украинский

source: The call to %s failed: %d (%s)
ru: Сбой вызова %s: %d (%s)

source: Cannot create a pipe for internal communication.
ru: Не удалось создать канал внутренней связи.

source: URL expected after -%s
ru: После -%s предполагалось указание URL-адреса

source: No running ELinks found.
ru: Не удалось найти выполняющийся экземпляр ELinks.

source: No remote session to connect to.
ru: Нет удалённых сеансов для подключения.

source: Unable to encode session info.
ru: Не удалось закодировать информацию сеанса.

source: Unable to attach_terminal().
ru: Не удалось выполнить функцию attach_terminal().

source: %d select() failures.
ru: Число сбоев при выполнении функции select(): %d.

source: Built on %s %s
ru: Сборка выполнена %s %s

source: Text WWW browser
ru: Текстовый веб-браузер

source: Features:
ru: Функциональные возможности:

source: Standard
ru: Стандартная версия

source: Debug
ru: Отладочная версия

source: Fastmem
ru: Высокоскоростная модификация

source: Own Libc Routines
ru: Собственные процедуры Libc

source: No Backtrace
ru: Без обратной трассировки

source: No mouse
ru: Без поддержки мыши

source: MIME type associations
ru: Сопоставление MIME-типов

source: Handler <-> MIME type association. The first sub-tree is the MIME class while the second sub-tree is the MIME type (ie. image/gif handler will reside at mime.type.image.gif). Each MIME type option should contain (case-sensitive) name of the MIME handler (its properties are stored at mime.handler.<name>).
ru: Сопоставление обработчика <-> MIME-типа. Первое поддерево является классом MIME, второе поддерево ? MIME-типом (то есть обработчик для image/gif будет располагаться в mime.type.image.gif). Каждый параметр MIME-типа должен содержать (регистрозависимое) имя его обработчика (свойства обработчика хранятся в параметре mime.handler.<name>).

source: Handler matching this MIME-type class ('*' is used here in place of '.').
ru: Обработчик, соответствующий этому классу MIME-типа (здесь "*" используется вместо ".").

source: Handler matching this MIME-type name ('*' is used here in place of '.').
ru: Обработчик, соответствующий этому имени MIME-типа (здесь "*" используется вместо ".").

source: File type handlers
ru: Обработчики файлов различных типов

source: A file type handler is a set of information about how to use an external program to view a file. It is possible to refer to it for several MIME types -- e.g., you can define an 'image' handler to which mime.type.image.png, mime.type.image.jpeg, and so on will refer; or one might define a handler for a more specific type of file -- e.g., PDF files. Note you must define both a MIME handler and a MIME type association for it to work.
ru: Обработчик файла определённого типа представляет собой набор информации по использованию внешней программы для просмотра такого файла. Обращения к одному обработчику также возможны по нескольким MIME-типам -- то есть, можно назначить обработчика изображений ("image") для mime.type.image.png, mime.type.image.jpeg и тому подобных; возможно назначение обработчика и для более специфических типов файлов -- например, PDF-файлов. Для этогонеобходимо задать обработчика и сопоставить с ним MIME-тип.

source: Description of this handler.
ru: Описание данного обработчика.

source: System-specific handler description (ie. unix, unix-xwin, ...).
ru: Описание обработчика для конкретной системы (ie. unix, unix-xwin, ...).

source: Ask before opening
ru: Запрашивать подтверждение перед открытием

source: Ask before opening.
ru: Запрашивать подтверждение перед открытием.

source: Block terminal
ru: Блокировка терминала

source: Block the terminal when the handler is running.
ru: Блокировать терминал при запуске обработчика.

source: Program
ru: Программа

source: External viewer for this file type. '%' in this string will be substituted by a file name. Do _not_ put single- or double-quotes around the % sign.
ru: Внешний просмотрщик для файлов этого типа. "%" в этой строке будет заменён на имя файла. Символ % не должен заключаться ни в одинарные, ни в двойные кавычки.

source: File extension associations
ru: Сопоставления расширений файлов

source: Extension <-> MIME type association.
ru: Расширение <-> сопоставление MIME-типа.

source: MIME-type matching this file extension ('*' is used here in place of '.').
ru: MIME-тип соответствующий расширению файла (здесь "*" используется вместо ".").

source: Option system
ru: Система параметров

source: Options for mailcap support.
ru: Параметры для поддержки mailcap.

source: Enable mailcap support.
ru: Включить поддержку mailcap.

source: Mailcap search path. Colon-separated list of files. Leave as "" to use MAILCAP environment variable instead.
ru: Путь поиска Mailcap. Список файлов, разделённых двоеточиями. Для использования переменной среды MAILCAP значение необходимо оставить пустым "".

source: Ask before using the handlers defined by mailcap.
ru: Запрашивать подтверждение перед использованием обработчиков, назначенных mailcap.

source: Type query string
ru: Строка типа запроса

source: Type of description to show in "what to do with this file" query dialog: 0 is show "mailcap" 1 is show program to be run 2 is show mailcap description field if any; "mailcap" otherwise
ru: Тип описания, выводящийся в диалоговом окне запроса "действия с этим файлом": 0 показать "mailcap" 1 показать запускаемую программу 2 показать поле описания mailcap при наличии такового; в противном случае - "mailcap"

source: Prioritize entries by file
ru: Приоритет записей в порядке следования файлов

source: Prioritize entries by the order of the files in the mailcap path. This means that wildcard entries (like: image/*) will also be checked before deciding the handler.
ru: Установить приоритет записей в порядке следования файлов в путях поиска mailcap. Это означает, что записи с подстановочными знаками (такие как: image/*) также будут проверяться перед определением обработчика.

source: Badly formated mailcap entry for type %s in "%s" line %d
ru: Неправильно отформатирована запись mailcap для типа %s в "%s", строка %d

source: Mimetypes files
ru: Файлы MIME-типов

source: Options for the support of mime.types files. These files can be used to find the content type of a URL by looking at the extension of the file name.
ru: Параметры для поддержки файлов mime.types. Эти файлы могут бытьиспользованы для определения типа содержимого, находящегося по URL-адресу путём анализа расширения имени файла.

source: Enable mime.types support.
ru: Включить поддержку mime.types.

source: The search path for mime.types files. Colon-separated list of files.
ru: Пути поиска файлов mime.types. Список файлов, разделённых двоеточиями.

source: Delete extension
ru: Удаление расширения

source: Delete extension %s -> %s?
ru: Удалить расширение %s -> %s?

source: Extension
ru: Расширение

source: Extension(s)
ru: Расширения

source: Content-Type
ru: Тип содержимого

source: No extensions
ru: Нет расширений

source: MIME-related options (handlers of various MIME types).
ru: Параметры, связанные с MIME-типами (обработчики различных MIME-типов).

source: Default MIME-type
ru: MIME-тип по умолчанию

source: Document MIME-type to assume by default (when we are unable to guess it properly from known information about the document).
ru: MIME-тип документа по умолчанию (при неспособности правильного определения типа документа по известной о нём информации).

source: Verify certificates
ru: Проверка сертификатов

source: Verify the peer's SSL certificate. Note that this needs extensive configuration of OpenSSL by the user.
ru: Проверка сертификата SSL узла. Имейте в виду, что для этого пользователь должен провести настройку расширенных параметров конфигурации OpenSSL.

source: Client Certificates
ru: Сертификаты клиента

source: X509 client certificate options.
ru: Параметры сертификата клиента X509.

source: Enable or not the sending of X509 client certificates to servers which request them.
ru: Включить отправку клиентских сертификатов X509 на серверы, которые их запрашивают.

source: Certificate File
ru: Файл сертификата

source: The location of a file containing the client certificate and unencrypted private key in PEM format. If unset, the file pointed to by the X509_CLIENT_CERT variable is used instead.
ru: Размещение файла, содержащего сертификат клиента и незашифрованный закрытый ключ в формате PEM. Если параметр отключён, используется файл, заданный в переменной X509_CLIENT_CERT.

source: Verify the peer's SSL certificate. If you enable this, set also "Trusted CA file".
ru: Проверить сертификат SSL узла. При включении параметра также необходимо задать "Trusted CA file".

source: Trusted CA file
ru: Файл доверенных ЦС

source: The location of a file containing certificates of trusted certification authorities in PEM format. ELinks then trusts certificates issued by these CAs. If you change this option or the file, you must restart ELinks for the changes to take effect. This option affects GnuTLS but not OpenSSL.
ru: Расположение файла, содержащего сертификаты доверенных центров сертификации в формате PEM. ELinks будет доверять сертификатам, выданным этими ЦС. При внесении изменений в этот параметр или в файл необходимо перезапустить ELinks, чтобы изменения вступили в силу. Этот параметр влияет на GnuTLS, но не на OpenSSL.

source: SSL options.
ru: Параметры SSL.

source: Waiting in queue
ru: Ожидание в очереди

source: Looking up host
ru: Поиск сервера

source: Making connection
ru: Соединение

source: SSL negotiation
ru: Согласование SSL

source: Request sent
ru: Запрос отправлен

source: Logging in
ru: Регистрация

source: Getting headers
ru: Получение заголовков

source: Server is processing request
ru: Сервер обрабатывает запрос

source: Transferring
ru: Пересылка

source: Resuming
ru: Возобновление

source: Connecting to peers
ru: Подключение к пирам

source: Connecting to tracker
ru: Подключение к трекеру

source: Waiting for redirect confirmation
ru: Ожидание подтверждения перенаправления

source: OK
ru: ОК

source: Interrupted
ru: Прервано

source: Socket exception
ru: Исключение в сокете

source: Internal error
ru: Внутренняя ошибка

source: Error writing to socket
ru: Ошибка записи в сокет

source: Error reading from socket
ru: Ошибка чтения из сокета

source: Data modified
ru: Дата изменена

source: Bad URL syntax
ru: Неверный синтаксис URL

source: Request must be restarted
ru: Необходимо повторить запрос

source: Can't get socket state
ru: Не удалось получить состояние сокета

source: Only local connections are permitted
ru: Разрешены только локальные подключения

source: No host in the specified IP family was found
ru: Не удалось найти узлы в указанном семействе IP-адресов

source: Error while decoding file. This might be caused by the encoded file being corrupt.
ru: Ошибка декодирования файла. Может быть вызвано повреждением закодированного файла.

source: This URL contains a protocol not yet known by ELinks. You can configure an external handler for it through the options system.
ru: Этот URL-адрес содержит протокол, который пока неизвестен ELinks. Однако система параметров позволяет настроить для него внешней обработчик.

source: This URL contains a protocol that is not natively known by ELinks which means that ELinks relies on external programs for handling it. Downloading URLs using external programs is not supported.
ru: Этот URL-адрес содержит протокол, который не имеет встроенной поддержки в ELinks. Это означает, что для их обработки ELinks использует внешние программы. Загрузка URL-адресов с использованием внешних программ не поддерживается.

source: Bad HTTP response
ru: Неверный ответ HTTP

source: No content
ru: Нет данных

source: Unknown file type
ru: Неизвестный тип файла

source: Error opening file
ru: Ошибка открытия файла

source: CGI script not in CGI path
ru: Сценарий CGI находится не в пути поиска CGI

source: Local file access is not allowed in anonymous mode
ru: Доступ к локальным файлам в анонимном режиме не допускается

source: Bad FTP response
ru: Неверный ответ HTTP

source: FTP service unavailable
ru: Сервис FTP недоступен

source: Bad FTP login
ru: Неверные учётные данные FTP

source: FTP PORT command failed
ru: Сбой выполнения команды FTP PORT

source: File not found
ru: Файл не найден

source: FTP file error
ru: Ошибка файла на FTP

source: SSL error
ru: Ошибка SSL

source: This version of ELinks does not contain SSL/TLS support
ru: Эта версия Elinks не поддерживает SSL/TLS

source: JavaScript support is not enabled
ru: Поддержка JavaScript не включена

source: Bad NNTP response
ru: Неверный ответ NNTP

source: Unable to handle news: URI because no news server has been been configured. Either set the option protocol.nntp.server or set the NNTPSERVER environment variable.
ru: Обработка новостей невозможна: Данный URI-адрес требует настройки сервера новостей. Установите значение параметра protocol.nntp.server, либо переменной среды NNTPSERVER.

source: Server hung up for some reason
ru: Сервер отключился по неизвестной причине

source: No such newsgroup
ru: Такой группы новостей не существует

source: No such article
ru: Такой статьи не существует

source: Transfer failed
ru: Сбой передачи

source: Authorization required
ru: Требуется авторизация

source: Access to server denied
ru: Доступ к серверу запрещён

source: The CSO phone-book protocol is not supported.
ru: Протокол CSO для телефонного справочника не поддерживается.

source: Configuration of the proxy server failed. This might be caused by an incorrect proxy setting specified by an environment variable or returned by a scripting proxy hook. The correct syntax for proxy settings are a host name optionally followed by a colon and a port number. Example: 'localhost:8080'.
ru: Сбой конфигурации прокси-сервера. Это может быть вызвано неверной настройкой прокси-сервера, указанной в переменной среды, либо возвращаемой сценарием обработчика соединений с прокси-сервером. Правильный синтаксис для настройки прокси-сервера обычно включает имя сервера, за которым после двоеточия может следовать номер порта. Пример: "localhost:8080".

source: BitTorrent error
ru: Ошибка BitTorrent

source: The BitTorrent metainfo file contained errors
ru: Файл метаданных BitTorrent содержит ошибки

source: The tracker requesting failed
ru: Сбой запроса к трекеру

source: The BitTorrent URL does not point to a valid URL
ru: BitTorrent ссылается на неверный URL-адрес

source: The bittorrent-peer URL scheme is for internal use only
ru: Схема URL-адреса BitTorrent-пир предназначена только для внутреннего использования

source: FSP server not found
ru: Сервер FSP не найден

source: Unknown error
ru: Неизвестная ошибка

source: ~Screen
ru: ~Экран

source: ~Window
ru: ~Окно

source: ~Full screen
ru: ~На весь экран

source: ~BeOS terminal
ru: Терминал ~BeOS

source: Authentication
ru: Аутентификация

source: Authentication required for %s at %s
ru: Требуется аутентификация для %s в области %s

source: Authentication required
ru: Требуется аутентификация

source: Login
ru: Имя пользователя

source: Password
ru: Пароль

source: Realm
ru: Область

source: none
ru: нет

source: State
ru: Состояние

source: valid
ru: действительная

source: Sorry, but auth entry "%s" cannot be deleted.
ru: Не удалось удалить запись аутентификации "%s".

source: Sorry, but auth entry "%s" is being used by something else.
ru: Запись аутентификации "%s" в данный момент используется.

source: Delete marked auth entries
ru: Удаление отмеченной записи аутентификации

source: Delete marked auth entries?
ru: Удалить отмеченные записи аутентификации?

source: Delete auth entry
ru: Удаление записи аутентификации

source: Delete this auth entry?
ru: Удалить эту запись аутентификации?

source: Clear all auth entries
ru: Удаление всех записей аутентификации

source: Do you really want to remove all auth entries?
ru: Удалить все записи аутентификации?

source: Authentication manager
ru: Диспетчер аутентификации

source: BitTorrent specific options.
ru: Параметры BitTorrent.

source: Port range
ru: Диапазон портов

source: Port range allowed to be used for listening on.
ru: Диапазон портов для прослушивания.

source: Minimum port
ru: Минимальный номер порта

source: The minimum port to try and listen on.
ru: Минимальный номер порта для прослушивания.

source: Maximum port
ru: Максимальный номер порта

source: The maximum port to try and listen on.
ru: Максимальный номер порта для прослушивания.

source: Tracker
ru: Трекер

source: Tracker options.
ru: Параметры трекера.

source: Use compact tracker format
ru: Принимать ответы трекера в компактном виде

source: Whether to request that the tracker returns peer info in compact format. Note, the compact format only supports IPv4 addresses.
ru: Запрашивать получение информации о пирах от трекера в компактном виде. Необходимо учитывать, что в компактном виде поддерживаются только адреса IPv4.

source: Tracker announce interval
ru: Интервал получения информации от трекера

source: The number of seconds to wait between periodically contacting the tracker for announcing progress and requesting more peers. Set to zero to use the interval requested by the tracker.
ru: Число секунд ожидания между периодической отправкой запросов на трекердля получения информации о процессе выполнения и предоставления большего числа пиров. Значение 0 задаёт использование интервала, устанавливаемого трекером.

source: IP-address to announce
ru: Анонсируемый IP-адрес

source: What IP address to report to the tracker. If set to "" no IP address will be sent and the tracker will automatically determine an appropriate IP address.
ru: IP-адрес для отправки трекеру. При установке пустого значения "" IP-адрес не отправляется и трекер определяет соответствующий IP-адрес автоматически.

source: User identification string
ru: Строка идентификации пользователя

source: An additional identification that is not shared with any users. It is intended to allow a client to prove their identity should their IP address change. It is an optional parameter, but some trackers require this parameter. If set to "" no user key will be sent to the tracker.
ru: Дополнительная идентификация, которая не используется другими пользователями. Предназначена для подтверждения идентификации клиента при изменении IP-адреса. Параметр необязательный, однако необходим для некоторых трекеров. В случае установки пустого значения "" ключ пользователя трекеру не отправляется.

source: Maximum number of peers to request
ru: Максимальное число запрашиваемых пиров
