Repository: nabetaro/elinks
Catalog: po/*.po
Languages: ru

source: Minimal height of listbox widget
ru: Минимальная высота элемента окна с выпадающим списком

source: Minimal height of the listbox widget (used e.g. for bookmarks or global history).
ru: Минимальная высота элемента с выпадающим списком в составе окна (может применяться в закладках или общей истории).

source: Drop shadows
ru: Отбрасывание теней

source: Make dialogs drop shadows (the shadows are solid, you can adjust their color by ui.colors.*.dialog.shadow). You may also want to eliminate the wide borders by adjusting setup.h.
ru: Включить отбрасывание теней в диалоговых окнах (тени сплошные, цвета теней можно настраивать с помощью параметров ui.colors.*.dialog.shadow). Также можно убрать широкие границы путём изменения параметров в файле setup.h.

source: Underline menu hotkeys
ru: Подчёркивание сочетаний клавиш в меню

source: Whether to underline hotkeys in menus to make them more visible. Requires that underlining is enabled for the terminal.
ru: Подчёркивать сочетания клавиш в меню для лучшей видимости. Необходимо включить поддержку подчёркивания в терминале.

source: Underline button shortcuts
ru: Подчёркивание сочетания клавиш для кнопок

source: Whether to underline button shortcuts to make them more visible. Requires that underlining is enabled for the terminal.
ru: Подчёркивать сочетания клавиш на кнопках для лучшей видимости. Необходимо включить поддержку подчёркивания в терминале.

source: Timer options
ru: Параметры таймера

source: Timed action after certain interval of user inactivity. Someone can even find this useful, although you may not believe that.
ru: Запуск действия после заданного интервала неактивности пользователя. Как ни странно, но и этой функции вполне можно найти применение.

source: Whether to enable the timer or not: 0 is don't count down anything 1 is count down, but don't show the timer 2 is count down and show the timer near LEDs
ru: Включать или не включать отсчёт таймера: 0 не включать отсчёт 1 включать отсчёт, но не показывать таймер 2 включать отсчёт и показывать таймер рядом со световыми индикаторами

source: Whether to enable the timer or not: 0 is don't count down anything 1 is count down, but don't show the timer 2 is count down and show the timer near LEDs (DISABLED)
ru: Включать или не включать отсчёт таймера: 0 не включать отсчёт 1 включать отсчёт, но не показывать таймер 2 включать отсчёт и показывать таймер рядом со световыми индикаторами (ОТКЛЮЧЕНО)

source: Duration
ru: Продолжительность

source: Inactivity timeout in seconds. The maximum of one day should be enough for just everyone (TM).
ru: Время ожидания активности в секундах. Максимум один день должно быть вполне достаточно для всех (TM).

source: Keybinding action to be triggered when timer reaches zero.
ru: Действие, вызываемое при достижении таймером нуля

source: Window tabs
ru: Вкладки окна

source: Window tabs settings.
ru: Настройка вкладок окна.

source: Display tabs bar
ru: Отображение панели вкладок

source: Show tabs bar on the screen: 0 means never 1 means only if two or more tabs are open 2 means always
ru: Отображение панели вкладок на экране: 0 никогда 1 только в случае открытия одной или двух вкладок 2 всегда

source: Tab bar at top
ru: Панель вкладок вверху

source: Whether display tab bar at top like other browsers do.
ru: Отображать панель вкладок вверху, как у других браузеров

source: Wrap-around tabs cycling
ru: Зациклить переключение между вкладками

source: When moving right from the last tab, jump to the first one, and vice versa.
ru: При переходе направо от последней вкладки переключаться на первую и наоборот.

source: Confirm tab closing
ru: Подтверждение закрытия вкладки

source: When closing a tab show confirmation dialog.
ru: При закрытии вкладки выводить диалоговое окно подтверждения.

source: Language
ru: Язык

source: Language of user interface. 'System' means that the language will be extracted from the environment dynamically.
ru: Язык интерфейса пользователя. Параметр "Система" означает, что язык определяется динамически по текущим настройкам среды.

source: Display menu bar always
ru: Постоянное отображение панели меню

source: Always show menu bar on the screen.
ru: Всегда отображать панель меню на экране.

source: Display status bar
ru: Отображение строки состояния

source: Show status bar on the screen.
ru: Показывать строку состояния на экране.

source: Display title bar
ru: Отображение заголовка

source: Show title bar on the screen.
ru: Отображать заголовок на экране.

source: Display goto dialog in new tabs
ru: Вывод диалогового окна перехода на новых вкладках

source: Pop up goto dialog in newly created tabs when there's no homepage set. This means also showing goto dialog on startup.
ru: Выводить диалоговое окно перехода при создании новых вкладок, если не задана домашняя страница. Это также означает вывод диалогового окна перехода при запуске приложения.

source: Show a message box when file is saved successfully
ru: Отображение окна сообщения при успешном сохранении файла

source: When you pressed a [ Save ] button in some manager, this option will make sure that a box confirming success of the operation will pop up.
ru: При нажатии кнопки [ Сохранить ] в каком-либо диспетчере, этот параметр обеспечит вывод сообщения в случае успешного завершения операции.

source: Sessions
ru: Сеансы

source: Sessions settings.
ru: Параметры сеансов.

source: Keep session active
ru: Сохранение активности сеанса.

source: Keep the session active even if the last terminal exits.
ru: Сохранять сеанс активным даже после закрытия последнего терминала.

source: Auto save session
ru: Автосохранение сеанса

source: Automatically save the session when quitting. This feature requires bookmark support.
ru: Автоматически сохранять сеанс при завершении работы. Для работы этой функции необходимо включить поддержку закладок.

source: Auto restore session
ru: Автоматическое восстановление сеанса

source: Automatically restore the session at start. This feature requires bookmark support.
ru: Автоматически восстанавливать сеанс при запуске. Для работы этой функции необходимо включить поддержку закладок.

source: Auto save and restore session folder name
ru: Имя папки для автоматического сохранения и восстановления сеанса

source: Name of the bookmarks folder used for auto saving and restoring session. The name has to be unique. Any folders with the same name will be deleted. This only makes sense with bookmark support.
ru: Имя папки закладок для автоматического сохранения и восстановления сеансов. Имя должно быть уникальным. Папки с одинаковым именем будут удалены. Для работы этой функции необходимо включить поддержку закладок.

source: Homepage URI
ru: URI-адрес домашней страницы

source: The URI to load either at startup time when no URI was given on the command line or when requested by the goto-url-home action. Set to "" if the environment variable WWW_HOME should be used as homepage URI instead.
ru: URI-адрес, загружаемый при запуске, если в командной строке не был задан другой URI-адрес, или в результате действия goto-url-home. Если в качестве URI-адреса задана пустая строка "", будет использована переменная среды WWW_HOME.

source: Date format
ru: Формат данных

source: Date format to use in dialogs. See strftime(3).
ru: Формат данных для использования в диалогах. Смотри описание strftime(3).

source: Set window title
ru: Заголовок окна

source: Set the window title when running in a windowing environment in an xterm-like terminal. This way the document's title is shown on the window titlebar.
ru: Задать заголовок окна при работе в оконной среде терминала наподобие xterm. В результате, заголовок документа будет показан в заголовке окна.

source: Read error
ru: Ошибка чтения

source: Boolean
ru: Логическое

source: Integer
ru: Целочисленное

source: Longint
ru: Большое целое число

source: String
ru: Строка

source: Color
ru: Цвет

source: Special
ru: Специальное

source: Alias
ru: Псевдоним

source: Folder
ru: Папка

source: Periodic Saving
ru: Периодическое сохранение

source: Goto URL History
ru: Переход к истории URL-адресов

source: Cookies
ru: Cookie-файлы

source: Cookies options.
ru: Параметры cookie-файлов.

source: Accept policy
ru: Политика использования

source: Cookies accepting policy: 0 is accept no cookies 1 is ask for confirmation before accepting cookie 2 is accept all cookies
ru: Политика использования cookie-файлов: 0 не принимать cookie-файлы 1 запрашивать подтверждение перед получением cookie-файла 2 принимать все cookie-файлы

source: Maximum age
ru: Срок действия

source: Cookie maximum age (in days): -1 is use cookie's expiration date if any 0 is force expiration at the end of session, ignoring cookie's expiration date 1+ is use cookie's expiration date, but limit age to the given number of days
ru: Максимальный срок действия (в днях): -1 использовать срок действия cookie-файла при наличии такового 0 принудительно завершать срок действия по окончании сеанса, игнорируя срок действия cookie-файла 1+ использовать срок действия cookie-файла, но ограничивать его указанным числом дней

source: Paranoid security
ru: Сверх-безопасность

source: When enabled, we'll require three dots in cookies domain for all non-international domains (instead of just two dots). Some countries have generic second level domains (eg. .com.pl, .co.uk) and allowing sites to set cookies for these generic domains could potentially be very bad. Note, it is off by default as it breaks a lot of sites.
ru: При включении этого параметра доменные имена cookie-файлов должны иметь три точки в имени для всех немеждународных доменов (вместо двух точек). У некоторых стран существует общий домен второго уровня (например, .com.pl, .co.uk), в связи с чем принимать от сайтов cookie-файлы для таких общих доменов потенциально небезопасно. Примите во внимание, что параметр по умолчанию отключен, так как это нарушает работу многих сайтов.

source: Saving
ru: Сохранение

source: Whether cookies should be loaded from and saved to disk.
ru: Позволяет загружать cookie-файлы и сохранять их на диск.

source: Resaving
ru: Повторное сохранение

source: Save cookies after each change in cookies list? No effect when cookie saving (cookies.save) is off.
ru: Сохранять cookie-файлы после каждого изменения в списке cookie-файлов? Не имеет силы при отключенном параметре сохранения cookie-файлов (cookies.save).

source: Cannot save cookies
ru: Не удалось сохранить cookie-файлы

source: ELinks was started without a home directory.
ru: ELinks был запущен без домашнего каталога.

source: ELinks was started with the -anonymous option.
ru: ELinks был запущен с параметром -anonymous.

source: Domain
ru: Домен

source: Path
ru: Путь

source: at quit time
ru: при завершении работы

source: Secure
ru: Безопасный

source: yes
ru: да

source: no
ru: нет

source: Do you want to accept a cookie from %s?
ru: Принять cookie-файл от %s?

source: Accept cookie?
ru: Принять cookie-файл?

source: ~Accept
ru: ~Принять

source: ~Reject
ru: ~Отклонить

source: Server
ru: Сервер

source: Sorry, but cookie "%s" cannot be deleted.
ru: Не удалось удалить cookie-файл "%s".

source: Sorry, but cookie "%s" is being used by something else.
ru: Cookie-файл "%s" в данный момент используется.

source: Sorry, but cookie domain "%s" cannot be deleted.
ru: Не удалось удалить доменную область cookie-файла "%s".

source: Sorry, but cookie domain "%s" is being used by something else.
ru: Доменная область cookie-файла "%s" в данный момент используется.

source: Delete marked cookies
ru: Удаление отмеченных cookie-файлов

source: Delete marked cookies?
ru: Удалить отмеченные cookie-файлы?

source: Delete domain's cookies
ru: Удаление доменной области cookie-файлов

source: Delete all cookies from domain "%s"?
ru: Удалить все cookie-файлы из доменной области "%s"?

source: Delete cookie
ru: Удаление cookie-файла

source: Delete this cookie?
ru: Удалить этот cookie-файл?

source: Clear all cookies
ru: Удаление всех cookie-файлов

source: Do you really want to remove all cookies?
ru: Удалить все cookie-файлы?

source: Add server
ru: Добавление сервера

source: Server name
ru: Имя сервера

source: Add ~server
ru: Добавить ~сервер

source: C~lear
ru: О~чистить

source: Cookie manager
ru: Диспетчер cookie-файлов

source: You are nowhere!
ru: Документ не загружен!

source: Link
ru: Ссылка

source: Link title
ru: Заголовок ссылки

source: Link image
ru: Изображение ссылки

source: Link last visit time
ru: Последнее время посещения ссылки

source: Link title (from history)
ru: Заголовок ссылки (из истории)

source: assumed
ru: принято

source: ignoring server setting
ru: игнорировать настройки сервера

source: Date
ru: Дата

source: Last visit time
ru: Последнее посещение

source: Unknown
ru: Неизвестно

source: Header info
ru: Информация о заголовке

source: Internal header info
ru: Информация о внутреннем заголовке

source: No header info.
ru: Информация о заголовке отсутствует.

source: Download
ru: Загрузка

source: ~Background
ru: В ~фоне

source: Background with ~notify
ru: В фоне с ~уведомлением

source: ~Abort
ru: ~Прервать

source: Abort and ~delete file
ru: Прервать и ~удалить файл

source: Sorry, but download "%s" cannot be interrupted.
ru: Не удалось прервать загрузку "%s".

source: Sorry, but download "%s" is being used by something else.
ru: Загружаемый файл "%s" в данный момент используется.

source: Interrupt marked downloads
ru: Прерывание отмеченных загрузок

source: Interrupt marked downloads?
ru: Прервать отмеченные загрузки?

source: Interrupt download
ru: Прерывание загрузки

source: Interrupt this download?
ru: Прервать эту загрузку?

source: Interrupt all downloads
ru: Прерывание всех загрузок

source: Do you really want to interrupt all downloads?
ru: Прервать все загрузки?

source: Abort and delete file
ru: Прервать и удалить файл

source: Download manager
ru: Диспетчер загрузок

source: Exmode
ru: Вызов внешней команды

source: About
ru: О программе

source: Keys
ru: Клавиши

source: Copying
ru: Права

source: ELinks %s %set al. This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, specifically version 2 of the License.
ru: ELinks %s %s и другие Это программа является свободным программным обеспечением; может распространяться и/или изменяться на условиях лицензии GNU General Public License версии 2, опубликованной "Фондом свободного программного обеспечения" (FSF).

source: Resources
ru: Ресурсы

source: %ld handle
ru: %ld дескриптор

source: %ld timer
ru: %ld таймер

source: %ld connection
ru: %ld соединение

source: %ld connecting
ru: %ld подключается

source: %ld transferring
ru: %ld выполняет передачу

source: %ld keepalive
ru: %ld поддерживает активность

source: %ld byte
ru: %ld байт

source: %ld file
ru: %ld файл

source: %ld in use
ru: %ld используется

source: %ld loading
ru: %ld загружается

source: Document cache
ru: Кэш документов

source: %ld formatted
ru: %ld отформатирован

source: %ld refreshing
ru: %ld обновляется

source: Interlinking
ru: Взаимосвязь

source: master terminal
ru: главный терминал

source: slave terminal
ru: подчинённый терминал

source: %ld terminal
ru: %ld терминал

source: %ld session
ru: %ld сеанс

source: Memory allocated
ru: Выделено памяти

source: %ld byte overhead
ru: %ld байт дополнительно

source: Save URL
ru: Сохранение ресурса по URL-адресу

source: Enter URL
ru: Введите URL-адрес

source: Exit ELinks
ru: Выход из Links

source: Do you really want to exit ELinks (and terminate all downloads)?
ru: Завершить работу с ELinks и прервать все загрузки?

source: Do you really want to exit ELinks?
ru: Завершить работу с ELinks?

source: No history
ru: История пуста

source: Go ~back
ru: Перейти ~назад

source: Go for~ward
ru: Перейти ~вперёд

source: Bookm~ark document
ru: Доб~вить документ в закладки

source: Toggle ~HTML/plain
ru: Переклю~чить HTML/код

source: ~Reload
ru: ~Обновить

source: Frame at ~full-screen
ru: Фрейм на полный экран

source: ~Pass frame URI to external command
ru: Пе~редать URI-адрес фрейма внешней команде

source: Nex~t tab
ru: С~ледующая вкладка

source: Pre~v tab
ru: П~редыдущая вкладка

source: ~Close tab
ru: ~Закрыть вкладку

source: C~lose all tabs but the current
ru: За~крыть все вкладки кроме текущей

source: B~ookmark all tabs
ru: До~бавить все вкладки в закладки

source: Pass tab URI to e~xternal command
ru: Передать URI-адрес вкладки в~нешней команде

source: Open new ~tab
ru: О~ткрыть новую вкладку

source: Open new tab in backgroun~d
ru: Открыть новую ~фоновую вкладку

source: ~Go to URL
ru: П~ерейти к URL-адресу

source: Go ~forward
ru: Перейти ~вперёд

source: ~History
ru: ~История

source: ~Unhistory
ru: ~Обратная история

source: ~Save as
ru: ~Сохранить как

source: Save UR~L as
ru: Со~хранить URL-адрес как

source: Sa~ve formatted document
ru: Сох~ранить форматированный документ

source: ~Kill background connections
ru: Разор~вать фоновые соединения

source: Flush all ~caches
ru: О~чистить все кэши

source: Resource ~info
ru: Инф~ормация о ресурсе

source: E~xit
ru: В~ыход

source: Open ~new window
ru: Открыть ~новое окно

source: ~OS shell
ru: Ко~мандная строка

source: Resize t~erminal
ru: Изменить ра~змеры терминала

source: Search ~backward
ru: Обратный по~иск

source: Find ~next
ru: Искать ~вперёд

source: Find ~previous
ru: Ис~кать назад

source: T~ypeahead search
ru: ~Упреждающий поиск

source: Toggle i~mages
ru: Переклю~чить вывод изображений

source: Toggle ~link numbering
ru: Пере~ключить нумерацию ссылок

source: Toggle ~document colors
ru: Переключить цвета ~документов

source: ~Wrap text on/off
ru: ~Переключение переноса текста

source: Document ~info
ru: Информация о ~документе

source: H~eader info
ru: Информация о ~заголовке

source: Rel~oad document
ru: Обновле~ние документа

source: ~Rerender document
ru: П~овторное отображение

source: ~ELinks homepage
ru: ~Домашняя страница ELinks

source: ~Documentation
ru: Д~окументация

source: ~Keys
ru: К~лавиши

source: LED ~indicators
ru: Све~товые индикаторы

source: ~Bugs information
ru: ~Информация об ошибках

source: ~Copying
ru: П~рава

source: Autho~rs
ru: Авто~ры

source: ~About
ru: ~О программе

source: ~Modify
ru: ~Изменить

source: ~Language
ru: ~Язык

source: C~haracter set
ru: Ко~дировка

source: ~Terminal options
ru: Па~раметры терминала

source: File ~extensions
ru: Рас~ширения файлов

source: ~Options manager
ru: ~Диспетчер параметров

source: ~Keybinding manager
ru: Ди~спетчер сочетаний клавиш

source: ~Save options
ru: Со~хранить параметры

source: Global ~history
ru: О~бщая история

source: ~Bookmarks
ru: ~Закладки

source: ~Cache
ru: ~Кэш

source: ~Downloads
ru: За~грузки

source: Coo~kies
ru: Cookie-фай~лы

source: ~Form history
ru: ~История заполнения форм

source: ~Authentication
ru: ~Проверка подлинности

source: ~File
ru: ~Файл

source: ~View
ru: ~Вид

source: ~Link
ru: ~Ссылки

source: ~Tools
ru: С~ервис

source: ~Setup
ru: ~Настройка

source: ~Help
ru: С~правка

source: Go to URL
ru: Перейти к URL-адресу

source: Save to file
ru: Сохранить в файл

source: Empty directory
ru: Пустой каталог

source: Directories:
ru: Каталоги:

source: Files:
ru: Файлы:

source: The environmental variable TERM is set to '%s'. ELinks maintains separate sets of values for these options and chooses the appropriate set based on the value of TERM. This allows you to configure the settings appropriately for each terminal in which you run ELinks.
ru: Переменная среды TERM имеет значение "%s". ELinks поддерживает отдельные наборы значений для этих параметров и выбирает подходящий набор на основе значения переменной TERM. Это позволяет правильно настраивать параметры для каждого терминала, в котором работает ELinks.

source: Terminal options
ru: Параметры терминала

source: Frame handling:
ru: Отображение рамок:

source: No frames
ru: Нет рамок

source: VT 100 frames
ru: Рамки VT 100

source: Linux or OS/2 frames
ru: Рамки Linux или OS/2

source: FreeBSD frames
ru: Рамки FreeBSD

source: KOI8-R frames
ru: Рамки KOI8-R

source: Color mode:
ru: Режим цвета:

source: No colors (mono)
ru: Без цвета (монохромный)

source: 16 colors
ru: 16 цветов

source: 88 colors
ru: 88 цветов

source: 256 colors
ru: 256 цветов

source: Resize terminal
ru: Изменить размеры терминала

source: Width=
ru: Ширина=

source: Height=
ru: Высота=

source: Received
ru: Получено

source: of
ru: из

source: Average speed
ru: Средняя скорость

source: average speed
ru: средняя скорость

source: avg
ru: в среднем

source: current speed
ru: текущая скорость

source: cur
ru: текущая

source: Elapsed time
ru: Затраченное время

source: elapsed time
ru: затраченное время

source: ETT
ru: Ожидаемое время передачи

source: Speed
ru: Скорость

source: speed
ru: скорость

source: estimated time
ru: Ожидаемое время

source: ETA
ru: Ожидаемое время завершения загрузки

source: Enter a mark to set
ru: Введите символ для создания метки

source: Enter a mark to which to jump
ru: Введите символ для перехода к метке

source: Keyboard prefix: %d
ru: Префиксная клавиша: %d

source: Cursor position: %dx%d
ru: Позиция курсора: %dx%d

source: Untitled
ru: Без названия

source: No document
ru: Нет документа

source: Cascading Style Sheets
ru: Каскадные таблицы стилей

source: Options concerning how to use CSS for styling documents.
ru: Параметры использования CSS для оформления документов.

source: Enable CSS
ru: Включить CSS

source: Enable adding of CSS style info to documents.
ru: Включить добавление информации о стилях CSS в документы.

source: Import external style sheets
ru: Импортировать внешние таблицы стилей

source: When enabled any external style sheets that are imported from either CSS itself using the @import keyword or from the HTML using <link> tags in the document header will also be downloaded.
ru: При включении параметра будут загружены любые внешние таблицы стилей, импортируемые либо из самих CSS-файлов с помощью ключевого слова @import, либо через HTML-тэги <link> в заголовке документа.

source: Default style sheet
ru: Таблица стилей по умолчанию

source: The path to the file containing the default user defined Cascading Style Sheet. It can be used to control the basic layout of HTML documents. The path is assumed to be relative to ELinks' home directory. Leave as "" to use built-in document styling.
ru: Путь к файлу, содержащему каскадную таблицу стилей, заданную пользователем по умолчанию. Может использоваться для базовой разметки HTML-документов. Путь указывается относительно домашнего каталога ELinks. Для использования таблицы стилей документа необходимо оставить пустое значение "".

source: ECMAScript options.
ru: Параметры ECMAScript.

source: Whether to run those scripts inside of documents.
ru: Разрешить запуск этих сценариев внутри документов.

source: Script error reporting
ru: Сообщения об ошибках сценария

source: Open a message box when a script reports an error.
ru: Открывать окно сообщения при возникновении ошибок в сценариях.

source: Ignore <noscript> content
ru: Игнорировать содержимое тэга <noscript>

source: Whether to ignore content enclosed by the <noscript> tag when ECMAScript is enabled.
ru: Игнорировать содержимое тэга <noscript> при включении сценария ECMAScript.

source: Maximum execution time
ru: Максимальное время выполнения

source: Maximum execution time in seconds for a script.
ru: Максимальное время выполнения для сценария в секундах.

source: Pop-up window blocking
ru: Блокирование всплывающих окон

source: Whether to disallow scripts to open new windows or tabs.
ru: Запрещать сценариям открытие новых окон или вкладок.

source: JavaScript Emergency
ru: Сбой JavaScript
