Repository: nabetaro/elinks
Catalog: po/*.po
Languages: ru

source: Name of the configuration file that all configuration options will be read from and written to. It should be relative to config-dir.
ru: Имя конфигурационного файла, использующегося для чтения и записи всех всех параметров конфигурации. Указывается относительно config-dir.

source: Print help for configuration options
ru: Вывод справки по параметрам конфигурации

source: Print help for configuration options and exit.
ru: Вывод справки по параметрам конфигурации и выход из программы.

source: MIME type assumed for unknown document types
ru: Тип MIME для неизвестных типов документов

source: The default MIME type used for documents of unknown type.
ru: Тип MIME, заданный по умолчанию для документов неизвестного типа.

source: Ignore user-defined keybindings
ru: Игнорировать настраиваемые сочетания клавиш

source: When set, all keybindings from configuration files will be ignored. It forces use of default keybindings and will reset user-defined ones on save.
ru: При установке этого параметра игнорируются все сочетания клавиш из конфигурационных файлов. Принудительно используются сочетания клавиш по умолчанию, а настраиваемые сочетания клавиш сбрасываются при сохранении.

source: Print formatted versions of given URLs to stdout
ru: Вывод в stdout форматированных версий заданных URL-адресов

source: Print formatted plain-text versions of given URLs to stdout.
ru: Вывод в stdout форматированных текстовых версий заданных URL-адресов.

source: Codepage to use with -dump
ru: Кодовая страница для -dump

source: Codepage used when formatting dump output.
ru: Кодовая страница, применяющаяся при форматированиивывода дампа.

source: Color mode used with -dump
ru: Цветовой режим для -dump

source: Color mode used with -dump.
ru: Цветовой режим для -dump.

source: Width of document formatted with -dump
ru: Ширина форматирования документа для -dump

source: Width of the dump output.
ru: Ширина вывода в дамп.

source: Evaluate configuration file directive
ru: Выполнение директив конфигурационного файла

source: Specify configuration file directives on the command-line which will be evaluated after all configuration files has been read. Example usage: -eval 'set protocol.file.allow_special_files = 1'
ru: Указывать в командной строке директивы конфигурационного файла, выполнение которых будут осуществляться после после чтения всех конфигурационных файлов. Пример использования: -eval "set protocol.file.allow_special_files = 1"

source: Interpret documents of unknown types as HTML
ru: Интерпретировать документы неизвестного типа как документы HTML

source: Makes ELinks assume documents of unknown types are HTML. Useful when using ELinks as an external viewer from MUAs. This is equivalent to -default-mime-type text/html.
ru: Документы неизвестного типа ELinks будет интерпретировать, как документы HTML.Это полезно при использовании ELinks в качестве внешнего просмотрщика из почтового клиента. Эквивалентно -default-mime-type text/html.

source: Print usage help and exit
ru: Вывод информации по использованию справки и выход из программы

source: Print usage help and exit.
ru: Вывод информации по использованию справки и выход из программы.

source: Only permit local connections
ru: Разрешать только местные соединения

source: Restricts ELinks to work offline and only connect to servers with local addresses (ie. 127.0.0.1). No connections to remote servers will be permitted.
ru: ELinks ограничивается работой в автономном режиме. Соединения разрешается устанавливать только с серверами, имеющими локальные адреса (то есть 127.0.0.1). Установка соединений с удалёнными серверами не допускается.

source: Print detailed usage help and exit
ru: Вывод подробной информации по использованию справки и выход из программы

source: Print detailed usage help and exit.
ru: Вывод подробной информации по использованию справки и выход из программы.

source: Look up specified host
ru: Поиск заданного узла

source: Look up specified host and print all DNS resolved IP addresses.
ru: Поиск заданного узла и вывод всех IP-адресов, распознанных DNS-сервером.

source: Run as separate instance
ru: Запуск в виде отдельного экземпляра

source: Run ELinks as a separate instance instead of connecting to an existing instance. Note that normally no runtime state files (bookmarks, history, etc.) are written to the disk when this option is used. See also -touch-files.
ru: Запускать ELinks в виде отдельного экземпляра, вместо соединения с существующим. Учтите, что файлы состояния среды выполнения (закладки, история и так далее) при использовании этого параметра обычно на диск не записываются. Смотри также -touch-files.

source: Disable use of files in ~/.elinks
ru: Не использовать файлы в каталоге ~/.elinks

source: Disables creation and use of files in the user specific home configuration directory (~/.elinks). It forces default configuration values to be used and disables saving of runtime state files.
ru: Прекращается создание и использование файлов в домашнем каталоге конфигурации пользователя (~/.elinks). Принудительно используются значения параметров по умолчанию и отключается сохранение файлов состояния среды исполнения.

source: Disable link numbering in dump output
ru: Отключение нумерации ссылок в выводе дампа

source: Prevents printing of link number in dump output. Note that this really affects only -dump, nothing else.
ru: Отключается вывод номеров ссылок в выводе дампа. Оказывает влияние исключительно на вывод -dump и ни на что больше.

source: Disable printing of link references in dump output
ru: Отключение вывода идентификаторов ресурсов в выводе дампа

source: Prevents printing of references (URIs) of document links in dump output. Note that this really affects only -dump, nothing else.
ru: Отключается вывод идентификаторов ресурсов (URI-адресов) в выводе дампа. Оказывает влияние исключительно на вывод -dump и ни на что больше.

source: Control an already running ELinks
ru: Управление уже выполняющимся экземпляром ELinks

source: Control a remote ELinks instance by passing commands to it. The option takes an additional argument containing the method which should be invoked and any parameters that should be passed to it. For ease of use, the additional method argument can be omitted in which case any URL arguments will be opened in new tabs in the remote instance. Following is a list of the supported methods: ping() : look for a remote instance openURL() : prompt URL in current tab openURL(URL) : open URL in current tab openURL(URL, new-tab) : open URL in new tab openURL(URL, new-window) : open URL in new window addBookmark(URL) : bookmark URL infoBox(text) : show text in a message box xfeDoCommand(openBrowser) : open new window
ru: Осуществляется управление удалённым экземпляром ELinks путём передачи команд. Параметр принимает дополнительный аргумент с указанием вызываемого метода, а также параметры, которые требуется ему передать. В целях простоты использования дополнительный аргумент с указанием метода может быть опущен, при этом все аргументы, содержащие URL-адреса будут открыты в новых вкладках на удалённом экземпляре Elinks. Ниже представлен список поддерживаемых методов: ping() : поиск удалённого экземпляра openURL() : вставка URL-адреса в текущую вкладку openURL(URL) : открытие URL-адреса в текущей вкладке openURL(URL, new-tab) : открытие URL-адреса в новой вкладке openURL(URL, new-window) : открытие URL-адреса в новом окне addBookmark(URL) : добавление URL-адреса в закладки infoBox(text) : вывод текста в окне сообщения xfeDoCommand(openBrowser) : открытие нового окна

source: Connect to session ring with given ID
ru: Соединение с кольцом сеансов по указанному идентификатору

source: ID of session ring this ELinks session should connect to. ELinks works in so-called session rings, whereby all instances of ELinks are interconnected and share state (cache, bookmarks, cookies, and so on). By default, all ELinks instances connect to session ring 0. You can change that behaviour with this switch and form as many session rings as you want. Obviously, if the session-ring with this number doesn't exist yet, it's created and this ELinks instance will become the master instance (that usually doesn't matter for you as a user much). Note that you usually don't want to use this unless you're a developer and you want to do some testing - if you want the ELinks instances each running standalone, rather use the -no-connect command-line option. Also note that normally no runtime state files are written to the disk when this option is used. See also -touch-files.
ru: Идентификатор кольца сеансов, с которым должен соединиться данный сеанс ELinks. ELinks работает в так называемых кольцах сеансов, где все экземпляры ELinks взаимосвязаны и совместно используют состояние (кэш, закладки, cookie-файлы и так далее). По умолчанию все экземпляры ELinks соединяются с кольцом сеанса 0. Такое поведение можно изменить с помощью данного переключателя и сформировать столько колец сеансов, сколько будет необходимо. Если же кольцо сеансов с указанным номером отсутствует, то оно будет создано, и данный экземпляр ELinks станет основным экземпляром (что для обычного пользователя очевидно не имеет никакого значения). Данная функция обычно интересует разработчиков, которые выполняют задачи тестирования. Соответственно, при автономной работе экземпляров ELinks лучше воспользоваться параметром командной строки -no-connect. Также важно отметить, что обычно при использовании данной функции файлы состояния среды исполнения на диск не записываются. См. также описание параметра -touch-files.

source: Print the source of given URLs to stdout
ru: Вывод исходного кода указанных URL-адресов на stdout

source: Print given URLs in source form to stdout.
ru: Вывод исходного кода указанных URL-адресов на stdout.

source: Touch files in ~/.elinks when running with -no-connect/-session-ring
ru: Работа с файлами в каталоге ~/.elinks при использовании параметров -no-connect/-session-ring

source: When enabled, runtime state files (bookmarks, history, etc.) are written to disk, even when -no-connect or -session-ring is used. The option has no effect if not used in conjunction with any of these options.
ru: При использовании данного параметра файлы состояния среды исполнения (закладки, история и так далее) записываются на диск даже при работе с параметрами -no-connect или -session-ring. Соответственно, применение его имеет смысл только совместно с одним из вышеназванных параметров.

source: Verbose level
ru: Уровень детализации

source: The verbose level controls what messages are shown at start up and while running: 0 means only show serious errors 1 means show serious errors and warnings 2 means show all messages
ru: Уровень детализации регулирует вывод сообщений при запуске и во время работы программы: 0 выводятся только серьёзные ошибки 1 выводятся серьёзные ошибки и предупреждения 2 выводятся все сообщения

source: Print version information and exit
ru: Вывод информации о версии и выход из программы

source: Print ELinks version information and exit.
ru: Вывод информации о версии ELinks и выход из программы.

source: ## This is ELinks configuration file. You can edit it manually, ## if you wish so; this file is edited by ELinks when you save ## options through UI, however only option values will be altered ## and all your formatting, own comments etc will be kept as-is.
ru: ## Это конфигурационный файл ELinks. При желании может ## быть отредактирован вручную. Elinks вносит изменения в файл ## при сохранении параметров через пользовательский интерфейс. ## Однако при этом меняются только значения параметров, а ## форматирование, комментарии и прочее подобное остаются ## без изменений.

source: ## This is ELinks configuration file. You can edit it manually, ## if you wish so; this file is edited by ELinks when you save ## options through UI, however only option values will be altered ## and missing options will be added at the end of file; if option ## is not written in this file, but in some file included from it, ## it is NOT counted as missing. Note that all your formatting, ## own comments and so on will be kept as-is.
ru: ## Это конфигурационный файл ELinks. При желании может ## быть отредактирован вручную. Elinks вносит изменения в файл ## при сохранении параметров через пользовательский интерфейс. ## Однако при этом меняются только значения параметров, ## а отсутствующие параметры добавляются в конец файла. ## Если параметр в данном файле отсутствует, но присутствует ## в каком-либо другом включаемом файле, то он не считается ## отсутствующим. При этом форматирование, комментарии ## и прочее подобное остаются без изменений.

source: ## This is ELinks configuration file. You can edit it manually, ## if you wish so, but keep in mind that this file is overwritten ## by ELinks when you save options through UI and you are out of ## luck with your formatting and own comments then, so beware.
ru: ## Это конфигурационный файл ELinks. При желании его можно ## редактировать вручную, но при этом необходимо помнить о том, ## что в случае сохранения параметров через пользовательский ## интерфейс ELinks файл будет перезаписан, форматирование ## и комментарии при этом не сохраняются.

source: ## Obviously, if you don't like what ELinks is going to do with ## this file, you can change it by altering the config.saving_style ## option. Come on, aren't we friendly guys after all?
ru: ## При желании поведение ELinks при сохранении этого файла ## можно изменить. Для этого необходимо внести изменения ## в параметр config.saving_style. Ребята, давайте жить дружно!

source: Automatically saved options
ru: Автоматически сохраняемые параметры

source: Automatically saved keybindings
ru: Автоматически сохраняемые сочетания клавиш

source: Write config success
ru: Успешная запись конфигурационного файла

source: Options were saved successfully to config file %s.
ru: Параметры успешно сохранены в конфигурационном файле %s.

source: ~Do not show anymore
ru: ~Больше не показывать

source: Write config error
ru: Ошибка записи конфигурационного файла

source: Unable to write to config file %s. %s
ru: Не удалось осуществить запись в конфигурационный файл %s. %s

source: modified
ru: изменено

source: (expand by pressing space)
ru: (развернуть нажатием пробела)

source: Type
ru: Тип

source: Value
ru: Значение

source: This value has been changed since you last saved your configuration.
ru: Это значение было изменено после последнего сохранения конфигурации.

source: N/A
ru: Нет

source: Description
ru: Описание

source: Error
ru: Ошибка

source: Bad option value.
ru: Недопустимое значение параметра.

source: Edit
ru: Изменить

source: This option cannot be edited. This means that this is some special option like a folder - try to press a space in order to see its contents.
ru: Внести изменение в данный параметр невозможно. Это означает, что он является параметром особого типа, например, папкой ? попробуйте нажать пробел для просмотра его содержимого.

source: Option names may only contain alpha-numeric characters in addition to '_' and '-'.
ru: Имя параметра может содержать только буквенно-цифровые символы, а также символ подчёркивания и дефис.

source: Add option
ru: Добавить параметр

source: Cannot add an option here.
ru: Добавить параметр сюда невозможно.

source: Sa~ve
ru: Со~хранить

source: Option manager
ru: Диспетчер параметров

source: Keystroke
ru: Сочетание клавиш

source: Action
ru: Действие

source: Keymap
ru: Раскладка

source: Keystroke already used
ru: Использующееся сочетание клавиш

source: The keystroke "%s" is currently used for "%s". Are you sure you want to replace it?
ru: Сочетание клавиш "%s" в данный момент используется для "%s". Заменить его?

source: Add keybinding
ru: Добавление сочетания клавиш

source: Invalid keystroke.
ru: Недопустимое сочетание клавиш.

source: Need to select an action.
ru: Необходимо выбрать действие.

source: Action: %s Keymap: %s Keystroke should be written in the format: [Shift-][Ctrl-][Alt-]Key Key: a,b,c,...,1,2,3,...,Space,Up,PageDown,Tab,Enter,Insert,F5,... Keystroke
ru: Действие: %s Раскладка: %s Сочетание клавиш необходимо вводить в формате: [Shift-][Ctrl-][Alt-]Клавиша Клавиша: a,b,c,...,1,2,3,...,Пробел,Up,PageDown,Tab,Ввод,Insert,F5,... Сочетание клавиш

source: ~Toggle display
ru: ~Переключить отображение

source: Keybinding manager
ru: Диспетчер сочетаний клавиш

source: Commandline options -config-dir set to %s, but could not create directory %s.
ru: В параметре командной строки -config-dir задано значение %s, однако каталог %s создать не удалось.

source: ELINKS_CONFDIR set to %s, but could not create directory %s.
ru: ELINKS_CONFDIR имеет значение %s, однако каталог %s создать не удалось.

source: Unable to find or create ELinks config directory. Please check if you have $HOME variable set correctly and if you have write permission to your home directory.
ru: Не удалось найти или создать каталог конфигурации ELinks. Проверьте правильность значения переменной $HOME и наличие прав на запись в домашний каталог.

source: Main mapping
ru: Основной набор сочетаний

source: Edit mapping
ru: Набор сочетаний для редактирования

source: Menu mapping
ru: Набор сочетаний для меню

source: Unrecognised keymap
ru: Неизвестная раскладка

source: Error parsing keystroke
ru: Ошибка распознания сочетания клавиш

source: Unrecognised action (internal error)
ru: Неизвестное действие (внутренняя ошибка)

source: Error registering event
ru: Ошибка регистрации события

source: Configuration system
ru: Система конфигурации

source: Configuration handling options.
ru: Параметры обработки конфигурации.

source: Comments
ru: Комментарии

source: Amount of comments automatically written to the config file: 0 is no comments are written 1 is only the "blurb" (name+type) is written 2 is only the description is written 3 is full comments are written
ru: Объём комментариев, автоматически записывающихся в конфигурационный файл: 0 комментарии не записываются 1 записывается только "blurb" (имя+тип) 2 записывается только описание 3 комментарии записываются полностью

source: Indentation
ru: Отступ

source: Shift width of one indentation level in the configuration file. Zero means that no indentation is performed at all when saving the configuration.
ru: Величина смещения одного уровня отступа в конфигурационном файле. Нуль означает полное отсутствие отступов при сохранении конфигурации.

source: Saving style
ru: Метод сохранения

source: Determines what happens when you tell ELinks to save options: 0 is only values of current options are altered 1 is values of current options are altered and missing options are added at the end of the file 2 is the configuration file is rewritten from scratch 3 is values of current options are altered and missing options CHANGED during this ELinks session are added at the end of the file
ru: Определяет порядок действия ELinks при сохранении параметров: 0 изменяются только значения текущих параметров 1 изменяются значения текущих параметров, а отсутствующие параметры добавляются в конец файла 2 конфигурационный файл перезаписывается заново 3 изменяются значения текущих параметров, а отсутствующие параметры, ИЗМЕНЁННЫЕ в ходе текущего сеанса ELinks, добавляются в конец файла

source: Comments localization
ru: Локализация комментариев

source: If set to 1, comments in the configuration file will be translated to the language used by UI. Note that if you have different language set in different terminals, the language used in the configuration file MAY be the same as on the terminal where you saved the file, but it should be generally considered unpredictable.
ru: Если установлено значение 1, комментарии в конфигурационном файле будут переведены на язык пользовательского интерфейса. Важно учитывать, что в случае различия языковых настроек у разных терминалов, язык перевода конфигурационного файла МОЖЕТ совпадать с языком терминала, в котором этот файл был сохранён, но точно предсказать это невозможно.

source: Saving style warnings
ru: Предупреждения для метода сохранения

source: This is internal option used when displaying a warning about obsolete config.saving_style. You shouldn't touch it.
ru: Это внутренний параметр, использующийся при отображении предупреждения об устаревшем значении config.saving_style. Данный параметр изменять не следует.

source: Show template
ru: Показывать шаблон

source: Show template options in autocreated trees in the options manager and save them to the configuration file.
ru: Показывать шаблоны параметров в автоматически создаваемых деревьях в диспетчере параметров и сохранять их в конфигурационном файле.

source: Connections
ru: Соединения

source: Connection options.
ru: Параметры соединений.

source: Asynchronous DNS
ru: Асинхронный DNS

source: Whether to use asynchronous DNS resolving.
ru: Использовать асинхронное DNS-распознавание.

source: Maximum connections
ru: Максимальное число соединений

source: Maximum number of concurrent connections.
ru: Максимальное число соединений одновременно

source: Maximum connections per host
ru: Максимальное число соединений на один сервер

source: Maximum number of concurrent connections to a given host.
ru: Максимальное число соединений с одним сервером одновременно.

source: Connection retries
ru: Число попыток подключения

source: Number of tries to establish a connection. Zero means try forever.
ru: Число попыток установить соединение. Нуль означает бесконечное число попыток.

source: Receive timeout
ru: Время ожидания при чтении

source: Receive timeout (in seconds).
ru: Время ожидания при чтении (в секундах).

source: Try IPv4 when connecting
ru: Использовать IPv4 при соединении

source: Whether to try to connect to a host over IPv4. Note that if connection.try_ipv6 is enabled too, it takes precedence. And better do not touch this at all unless you are sure what are you doing. Note that you can also force a given protocol to be used on a per-connection basis by using a URL in the style of e.g. http4://elinks.cz/.
ru: Пытаться устанавливать соединение с сервером по протоколу IPv4. Необходимо иметь в виду, что параметр connection.try_ipv6 будет иметь приоритет, если он тоже активирован. В целом, изменять этот параметр имеет смысл только в случае ясного понимания смысла вносимых изменений. Также имейте в виду, что для каждого соединения можно принудительно задать протокол путём использования соответствующего URL-адреса, например, http4://elinks.cz/.

source: Whether to try to connect to a host over IPv4. Do not touch this option. Note that you can also force a given protocol to be used on a per-connection basis by using a URL in the style of e.g. http4://elinks.cz/.
ru: Пытаться устанавливать соединение с сервером по протоколу IPv4. Данный параметр изменять не следует. Также имейте в виду, что для каждого соединения можно принудительно задать протокол путём использования соответствующего URL-адреса, например, http4://elinks.cz/.

source: Try IPv6 when connecting
ru: Использовать IPv6 при соединении

source: Whether to try to connect to a host over IPv6. Note that you can also force a given protocol to be used on a per-connection basis by using a URL in the style of e.g. http6://elinks.cz/.
ru: Пытаться устанавливать соединение с сервером по протоколу IPv6. Также имейте в виду, что для каждого соединения можно принудительно задать протокол путём использования соответствующего URL-адреса, например, http6://elinks.cz/.

source: Timeout for non-restartable connections
ru: Время ожидания для неперезапускаемых соединений

source: Timeout for non-restartable connections (in seconds).
ru: Время ожидания для неперезапускаемых соединений (в секундах)

source: Document
ru: Документ

source: Document options.
ru: Параметры отображения документа.

source: Browsing
ru: Просмотр
