Repository: nabetaro/elinks
Catalog: po/*.po
Languages: ru

source: Rules for rewriting URIs entered in the goto dialog. It makes it possible to define a set of prefixes that will be expanded if they match a string entered in the goto dialog. The prefixes can be dumb, meaning that they work only like URI abbreviations, or smart ones, making it possible to pass arguments to them like search engine keywords.
ru: Правила подстановки URI-адресов в диалоговом окне перехода. Здесь задаётся набор префиксов для подстановки. Подстановка выполняется, когда строки, введённые в диалоговом окне перехода, совпадают с этими префиксами. Префиксы могут быть простыми, в виде аббревиатур для URI-адресов, или интеллектуальными, с возможностью передачи аргументов, например, ключевых слов для поисковых систем.

source: Enable dumb prefixes
ru: Активировать простые префиксы

source: Enable dumb prefixes - simple URI abbreviations which can be written to the Goto URL dialog instead of actual URIs - i.e. if you write 'elinks' there, you are directed to http://elinks.cz/.
ru: Активировать простые префиксы - простые аббревиатуры URI-адресов, которые вводятся в диалоговом окне перехода вместо настоящих URI-адресов -то есть при вводе в этом поле строки "elinks" происходит подстановка адреса http://elinks.cz/.

source: Enable smart prefixes
ru: Активировать интеллектуальные префиксы

source: Enable smart prefixes - URI templates triggered by writing given abbreviation to the Goto URL dialog followed by a list of arguments from which the actual URI is composed - i.e. 'gg:search keywords' or 'gn search keywords for news'.
ru: Активировать интеллектуальные префиксы - шаблоны URI-адресов, применяющиеся при вводе в диалоговом окне перехода соответствующих аббревиатур с заданным набором аргументов, из которых собирается URI-адрес - например, "gg:ключевое слово для поиска" или "gn ключевое слово для поиска новостей".

source: Dumb Prefixes
ru: Простые префиксы

source: Dumb prefixes, see enable-dumb description for details.
ru: Простые префиксы, смотри подробное описание для enable-dumb.

source: Replacement URI for this dumbprefix: %c in the string means the current URL %% in the string means '%'
ru: URI-адрес для подстановки в данном простом префиксе: %c в строке означает текущий URL-адрес %% в строке означает "%"

source: Smart Prefixes
ru: Интеллектуальные префиксы

source: Smart prefixes, see enable-smart description for details.
ru: Интеллектуальные префиксы, смотри подробное описание для enable-smart.

source: Replacement URI for this smartprefix: %c in the string means the current URL %s in the string means the whole argument to smartprefix %0,%1,...,%9 means argument 0, 1, ..., 9 %% in the string means '%'
ru: URI-адрес для подстановки в данном интеллектуальном префиксе: %c в строке означает текущий URL-адрес %s в строке означает аргумент для интеллектуального префикса полностью %0,%1,...,%9 означает параметр 0, 1, ..., 9 %% в строке означает "%"

source: Default template
ru: Шаблон по умолчанию

source: Default URI template used when the string entered in the goto dialog does not appear to be a URI or a filename (i.e. contains no '.', ':' or '/' characters), and does not match any defined prefixes. Set the value to "" to disable use of the default template rewrite rule. %c in the template means the current URL, %s in the template means the whole string from the goto dialog, %0,%1,...,%9 mean the 1st,2nd,...,10th space-delimited part of %s, %% in the template means '%'.
ru: Шаблон подстановки URI-адреса по умолчанию используется, когда строка, введённая в диалоговом окне перехода не похожа на URI-адрес или имя файла (например, не содержит символов ".", ":" или "/") и не совпадает с заданными префиксами. Ввод пустой строки "" отменяетправило подстановки шаблона по умолчанию. %c в шаблоне означает текущий URL-адрес, %s в шаблоне означает всю строку из диалогового окна перехода целиком, %0,%1,...,%9 означает 1-ю,2-ю,...,10-ю разделённую пробелом часть %s %% в шаблоне означает "%".

source: URI rewrite
ru: Подстановка URI-адреса

source: SAMBA specific options.
ru: Параметры SAMBA.

source: Credentials
ru: Учётные данные

source: Credentials file passed to smbclient via -A option.
ru: Файл учётных данных, передаваемый на smbclient с параметром -A.

source: User protocols
ru: Настраиваемые протоколы

source: User protocols. Options in this tree specify external handlers for the appropriate protocols. Ie. protocol.user.mailto.unix.
ru: Настраиваемые протоколы. Параметры в этом дереве содержат внешние обработчики для соответствующих протоколов. Например, protocol.user.mailto.unix.

source: Handler (external program) for this protocol. Name the options in this tree after your system (ie. unix, unix-xwin).
ru: Обработчик (внешняя программа) для этого протокола. Имена параметровв этом дереве следует задавать после указания системы (то есть, unix, unix-xwin).

source: Handler (external program) for this protocol and system. %f in the string means file name to include form data from %h in the string means hostname (or email address) %p in the string means port %d in the string means path (everything after the port) %s in the string means subject (?subject=<this>) %u in the string means the whole URL
ru: Обработчик (внешняя программа) для данного протокола и системы. %f в строке означает имя файла, из которого вносятся данные %h в строке означает имя сервера (или адрес электронной почты) %p в строке означает порт %d в строке означает путь (содержимое строки после номера порта) %s в строке означает тему (?subject=<this>) %u в строке означает весь URL-адрес

source: No program
ru: Нет программы

source: No program specified for protocol %s.
ru: Не указана программа для протокола %s.

source: Error registering event hook
ru: Ошибка записи обработчика события

source: User dialog
ru: Пользовательский диалог

source: Lua Error
ru: Ошибка Lua

source: Lua Console
ru: Консоль Lua

source: Enter expression
ru: Введите выражение

source: Ruby Message
ru: Сообщение Ruby

source: [%s error] %s
ru: [Ошибка %s] %s

source: An error occurred while running a %s script
ru: Произошла ошибка при выполнении сценария %s

source: Browser scripting error
ru: Ошибка поддержки сценариев в браузере

source: Scripting
ru: Поддержка сценариев

source: User script alert
ru: Оповещение пользовательского сценария

source: Download error
ru: Ошибка загрузки

source: Could not create file '%s': %s
ru: Не удалось создать файл "%s": %s

source: Error downloading %s: %s
ru: Ошибка загрузки %s: %s

source: '%s' is a directory.
ru: "%s" является каталогом.

source: File exists
ru: Файл существует

source: This file already exists: %s The alternative filename is: %s
ru: Файл с таким именем уже существует: %s Другой вариант имени файла: %s

source: Sa~ve under the alternative name
ru: Со~хранить с другим именем

source: ~Overwrite the original file
ru: ~Перезаписать исходный файл

source: ~Resume download of the original file
ru: ~Возобновить загрузку исходного файла

source: Unknown type
ru: Неизвестный тип

source: What would you like to do with the file '%s' (type: %s%s%s)?
ru: Дальнейшие действия с файлом "%s" (тип: %s%s%s)?

source: What would you like to do with the file (type: %s%s%s)?
ru: Дальнейшие действия с файлом (тип: %s%s%s)?

source: Program ('%' will be replaced by the filename)
ru: Программа ("%" будет заменено именем файла)

source: Block the terminal
ru: Блокировать терминал

source: The file will be opened with the program '%s'.
ru: Файл будет открыт программой "%s".

source: ~Open
ru: ~Открыть

source: Warning
ru: Внимание

source: You have an empty string in protocol.http.user_agent - this was a default value in the past, substituted by default ELinks User-Agent string. However, currently this means that NO User-Agent HEADER WILL BE SENT AT ALL - if this is really what you want, set its value to " ", otherwise please delete the line with this setting from your configuration file (if you have no idea what I'm talking about, just do this), so that the correct default setting will be used. Apologies for any inconvience caused.
ru: Значение параметра protocol.http.user_agent содержит пустую строку. Ранее такое значение устанавливалось по умолчанию, но затем значением по умолчанию стала строка ELinks User-Agent. Поэтому сейчас наличие пустой строки означает, что заголовок "User-Agent" НЕ БУДЕТ ОТПРАВЛЯТЬСЯ СОВСЕМ. Если предполагается именно такое поведение, то либо установите значение " ", либо удалите строку с этой настройкой из конфигурационного файла (если смысл сказанного непонятен, то настоятельно рекомендуется последовать данным указаниям), чтобы по умолчанию использовалось правильное значение. Приносим извинения за оказанные неудобства.

source: You have option config.saving_style set to a de facto obsolete value. The configuration saving algorithms of ELinks were changed from the last time you upgraded ELinks. Now, only those options which you actually changed are saved to the configuration file, instead of all the options. This simplifies our situation greatly when we see that some option has an inappropriate default value or we need to change the semantics of some option in a subtle way. Thus, we recommend you change the value of config.saving_style option to 3 in order to get the "right" behaviour. Apologies for any inconvience caused.
ru: Значение параметра config.saving_style содержит уже фактически устаревшее значение. С момента последнего обновления ELinks алгоритмы сохранения конфигурации были изменены. Сейчас в конфигурационный файл сохраняются не все параметры, а только те из них, значения которых поменялись. Это значительно упрощает логику поведения при обнаружении неверно установленного значения по умолчанию у одного параметра или при необходимости внести тонкие корректировки в семантику другого. Поэтому настоятельно рекомендуется заменить значение параметра config.saving_style на 3 для обеспечения "правильного" поведения. Приносим извинения за оказанные неудобства.

source: Welcome
ru: Здравствуйте!

source: Welcome to ELinks! Press ESC for menu. Documentation is available in Help menu.
ru: Добро пожаловать в ELinks! Нажмите ESC для вызова меню. Документацию можно посмотреть в меню "Справка".

source: The URL you are about to follow might be maliciously crafted in order to confuse you. By following the URL you will be connecting to host "%s" as user "%s". Do you want to go to URL %s?
ru: URL-адрес, по которому выполняется переход, может оказаться специально созданным со злонамеренной целью ввести пользователя в заблуждение. При переходе по этому URL-адресу произойдёт соединение с сервером "%s" в качестве пользователя "%s". Продолжить переход по URL-адресу %s?

source: Do you want to follow the redirect and post form data to URL %s?
ru: Выполнить перенаправление и отправить данные формы по URL-адресу %s?

source: The form data you are about to post might be incomplete. Do you want to post to URL %s?
ru: Отправляемые данные формы могут быть неполными. Отправить данные по URL-адресу %s?

source: Do you want to post form data to URL %s?
ru: Отправить данные формы по URL-адресу %s?

source: Do you want to repost form data to URL %s?
ru: Повторно отправить данные формы по URL-адресу %s?

source: Bad terminal size: %d, %d
ru: Неверный размер терминала: %d, %d

source: Warning: terminal name contains illicit chars.
ru: Предупреждение: имя терминала содержит запрещённые символы.

source: Failed to create session.
ru: Не удалось создать сеанс.

source: Bad event %d
ru: Неверное событие %d

source: Could not read event: %d (%s)
ru: Не удалось выполнить чтение события: %d (%s)

source: Too many bytes read from the itrm!
ru: Слишком много байт считано из itrm!

source: Do you really want to close the current tab?
ru: Закрыть текущую вкладку?

source: Do you really want to close all except the current tab?
ru: Закрыть все вкладки, кроме текущей?

source: Cannot read the file
ru: Не удалось прочитать файл

source: Cannot get file status
ru: Не удалось получить статус файла

source: Cannot access the file
ru: Не удалось получить доступ к файлу

source: Cannot create temp file
ru: Не удалось создать временный файл

source: Cannot rename the file
ru: Не удалось переименовать файл

source: File saving disabled by option
ru: Безопасное сохранение файлов отключено соответствующим параметром

source: Cannot write the file
ru: Не удалось записать файл

source: Secure file saving error
ru: Ошибка безопасного сохранения файла

source: Can't write to stdout: %s
ru: Не удалось выполнить запись в stdout: %s

source: Can't write to stdout.
ru: Не удалось выполнить запись в stdout.

source: URL protocol not supported (%s).
ru: Протокол URL-адреса не поддерживается (%s).

source: Missing fragment
ru: Отсутствует фрагмент

source: The requested fragment "%s" doesn't exist.
ru: Отсутствует необходимый фрагмент "%s".

source: Error while posting form
ru: Ошибка при отправке формы

source: Could not load file %s: %s
ru: Не удалось загрузить файл %s: %s

source: Reset form
ru: Сброс формы

source: Harmless button
ru: Неопасная кнопка

source: Submit form to
ru: Передача формы по адресу

source: Post form to
ru: Отправка формы по адресу

source: Radio button
ru: Радио-кнопка

source: Select field
ru: Выберите поле

source: Text area
ru: Текстовое поле

source: File upload
ru: Отправка файла

source: Password field
ru: Поле пароля

source: name
ru: метка

source: value
ru: значение

source: read only
ru: только для чтения

source: press %s to navigate
ru: нажмите %s для перехода

source: press %s to edit
ru: нажмите %s для изменения

source: press %s to submit to %s
ru: нажмите %s для передачи по адресу %s

source: press %s to post to %s
ru: нажмите %s для отправки по адресу %s

source: Useless button
ru: Бесполезная кнопка

source: Submit button
ru: Кнопка отправки

source: Display ~usemap
ru: Отобразить ~карту ссылок

source: ~Follow link
ru: ~Перейти по ссылке

source: Follow link and r~eload
ru: Перейти по ссылке и пере~загрузить

source: Open in new ~window
ru: Открыть в новом ~окне

source: Open in new ~tab
ru: Открыть в новой ~вкладке

source: Open in new tab in ~background
ru: Открыть в новой ~фоновой вкладке

source: ~Download link
ru: ~Скачать по ссылке

source: ~Add link to bookmarks
ru: Добавить ссы~лку в закладки

source: Pass link URI to e~xternal command
ru: Передать URI-адрес ссылки ~внешней команде

source: ~Reset form
ru: С~бросить форму

source: Open in ~external editor
ru: Открыть во в~нешнем редакторе

source: ~Submit form
ru: ~Отправить форму

source: Submit form and rel~oad
ru: Отправить ~форму и перезагрузить страницу

source: Submit form and open in new ~window
ru: Отправить форму и открыть в новом ~окне

source: Submit form and open in new ~tab
ru: Отправить форму и открыть в новой ~вкладке

source: Submit form and open in new tab in ~background
ru: Отправить форму и открыть в новой фоновой ~вкладке

source: Submit form and ~download
ru: Отправить форму и ~загрузить

source: Form f~ields
ru: Поля ф~ормы

source: V~iew image
ru: Прос~мотреть изображение

source: Download ima~ge
ru: С~качать изображение

source: No link selected
ru: Ссылка не выбрана

source: Image
ru: Рисунок

source: Usemap
ru: Карта ссылок

source: Marks
ru: Метки

source: Search hit top, continuing at bottom.
ru: Искать с начала, продолжая до конца.

source: Search hit bottom, continuing at top.
ru: Искать с конца, продолжая до начала.

source: No previous search
ru: Предыдущий поиск отсутствует

source: Could not compile regular expression '%s'
ru: Не удалось скомпилировать регулярное выражение "%s"

source: No further matches for '%s'.
ru: Далее совпадений для "%s" не обнаружено.

source: Could not find a link with the text '%s'.
ru: Не удалось найти ссылку, содержащую текст "%s".

source: Typeahead
ru: Упреждающий поиск

source: No links in current document
ru: В текущем документе ссылок нет

source: Search for text
ru: Поиск текста

source: Normal search
ru: Обычный поиск

source: Regexp search
ru: Поиск по регулярному выражению

source: Extended regexp search
ru: Поиск по расширенному регулярному выражению

source: Case sensitive
ru: С учётом регистра

source: Case insensitive
ru: Без учёта регистра

source: Search backward
ru: Обратный поиск

source: Search History
ru: История поиска

source: You cannot launch an external editor in the anonymous mode.
ru: Запуск внешнего редактора в анонимном режиме невозможен.

source: You can do this only on the master terminal
ru: Выполнение данного действия возможно только на главном терминале

source: You have exceeded the textarea's size limit: your input is %d bytes, but the maximum is %u bytes. Your input has been truncated, but you can still recover the text that you entered from this file: %s
ru: Превышено ограничение текстового поля: было введено %d байт при максимальном размере поля %u байт. Данные ввода были частично обрезаны, но введённый текст можно восстановить из следующего файла: %s

source: Go to link
ru: Перейти по ссылке

source: Enter link number
ru: Введите номер ссылки

source: Save error
ru: Ошибка сохранения

source: Error writing to file
ru: Ошибка записи в файл

source: Timer
ru: Таймер

source: Viewer
ru: Просмотрщик
