Repository: nabetaro/elinks
Catalog: po/*.po
Languages: ru

source: Document browsing options (mainly interactivity).
ru: Параметры просмотра документа (в основном интерактивные).

source: Access keys
ru: Клавиши доступа

source: Options for handling of link access keys. An HTML document can use the ACCESSKEY attribute to assign an access key to an element. When an access key is pressed, the corresponding element will be given focus.
ru: Параметры работы с клавишами доступа для ссылок. В документе HTML атрибут ACCESSKEY может использоваться для задания клавиши доступа к элементу. При нажатии клавиши доступа активируется соответствующий элемент.

source: Automatic links following
ru: Автоматический переход по ссылке

source: Automatically follow a link or submit a form if appropriate accesskey is pressed - this is the standard behaviour, but it's considered dangerous.
ru: Автоматический переход по ссылке или отправка формы при нажатии соответствующей клавиши доступа - это стандартное поведение, но считается небезопасным.

source: Display access key in link info
ru: Отображение клавиши доступа в сведениях о ссылке

source: Display access key in link info.
ru: Отображение клавиши доступа в сведениях о ссылке.

source: Accesskey priority
ru: Приоритет клавиши доступа

source: Priority of 'accesskey' HTML attribute: 0 is first try all normal bindings; if it fails, check accesskey 1 is first try only frame bindings; if it fails, check accesskey 2 is first check accesskey (this can be dangerous)
ru: Приоритет использования атрибута HTML "accesskey": 0 сначала использовать стандартные сочетания; при неудаче - клавишу доступа 1 сначала использовать сочетания для фрейма; при неудаче - клавишу доступа 2 сначала использовать клавишу доступа (может быть небезопасно)

source: Forms
ru: Формы

source: Options for handling of the forms interaction.
ru: Параметры регулирования порядка взаимодействия с формами

source: Submit form automatically
ru: Автоматическая отправка формы

source: Automagically submit a form when enter is pressed with a text field selected.
ru: Автоматически отправлять форму, если при нажатии клавиши ВВОД активно текстовое поле.

source: Confirm submission
ru: Подтверждение отправки

source: Ask for confirmation when submitting a form.
ru: Запрашивать подтверждение при отправке формы.

source: Default form input size
ru: Размер текстового поля формы по умолчанию

source: Default form input size if none is specified.
ru: Размер текстового поля формы по умолчанию при отсутствии указаний.

source: Insert mode
ru: Режим ввода

source: The setting for this option affects how key presses are handled when one selects a text-input form-field. When enabled, one must explicitly 'enter' a selected text-field to edit it; this prevents text fields from capturing key presses, such as presses of a scroll key, when it is inadvertently selected. When disabled, key presses are always inserted into a selected text field.
ru: Значение этого параметра регулирует обработку нажатия клавиш при работе с текстовым полем формы. При включенном параметре необходимо выполнить явный ?вход? в выбранное текстовое поле для его редактирования; это позволяет избежать захвата нажатия клавиш текстовым полем, например, нажатие клавиши прокрутки при ненамеренном выборе текстового поля. При отключении параметра нажатие клавиш всегда направляется в выбранное текстовое поле.

source: External editor
ru: Внешний редактор

source: Path to the executable that ELinks should launch when the user requests to edit a textarea with an external editor. If this is blank, ELinks will use the value of the environmental variable $EDITOR. If $EDITOR is empty or not set, ELinks will then default to "vi".
ru: Путь к исполняемому файлу, который будет запускаться приложением ELinks при получении от пользователя запроса на редактирование текстового поля с применением внешнего редактора. Если значение параметра отсутствует, ELinks будет использовать значение переменной среды $EDITOR. Если значение переменной $EDITOR пустое или не задано, ELinks по умолчанию запускает редактор ?vi?.

source: Images
ru: Изображения

source: Options for handling of images.
ru: Параметры для работы с изображениями.

source: Display style for image tags
ru: Способ отображения тэгов изображений

source: Display style for image tags when displayed: 0 means always display IMG 1 means always display filename 2 means display alt/title attribute if possible, IMG if not 3 means display alt/title attribute if possible, filename if not
ru: Способ отображения тегов изображений: 0 всегда отображать "IMG" 1 всегда отображать имя файла 2 по возможности отображать атрибуты "alt"/"title", а при их отсутствии отображать "IMG" 3 по возможности отображать атрибуты "alt"/"title", а при их отсутствии отображать имя файла

source: Maximum length for image filename
ru: Максимальная длина имени файла изображения

source: Maximum length of image filename when displayed: 0 means always display full filename 1-500 means display filename with this maximal length; if it is longer, the middle is substituted by an asterisk
ru: Максимальная длина отображаемого имени файла изображения: 0 всегда отображать полное имя файла 1-500 отображать имя файла с указанной максимальной длиной; если имя окажется длиннее, подставлять в середине символ звёздочки

source: Image links tagging
ru: Маркировка текста изображения

source: When to enclose image links: 0 means never 1 means never if alt or title are provided (old behavior) 2 means always
ru: Текст изображения окружается заданными символами: 0 никогда 1 никогда в случае наличия атрибутов "alt" или "title" (старое поведение) 2 всегда

source: Image link prefix
ru: Префикс текста изображения

source: Prefix string to use to mark image links.
ru: Строка префикса для маркировки текста изображения.

source: Image link suffix
ru: Суффикс текста изображения

source: Suffix string to use to mark image links.
ru: Строка суффикса для маркировки текста изображения.

source: Maximum length for image label
ru: Максимальная длина подписи изображения

source: Maximum length of image label (alt/title): 0 means always display full label 1-500 means display label with this maximal length; if it is longer, the middle is substituted by an asterisk
ru: Максимальная длина подписи изображения (атрибуты "alt"/"title"): 0 всегда отображать подпись целиком 1-500 отображать подпись указанной максимальной длины; если подпись окажется длиннее, подставлять в середине символ звёздочки

source: Display links to images w/o alt
ru: Отображение ссылок на изображения без атрибута "alt"

source: Display links to images without an alt attribute. If this option is off, these images are completely invisible.
ru: Отображать ссылки на изображения, не имеющие атрибута "alt". При отключении данного параметра изображения становятся полностью невидимыми.

source: Display links to images
ru: Отображение ссылок на изображения

source: Display links to any images in the document, regardless of them having an alt attribute or not. If this option is off, the alt attribute contents is shown, but as normal text, not selectable as a link.
ru: Отображать ссылки на все изображения в документе вне зависимости от наличия или отсутствия атрибута "alt". При отключении данного параметра выводится содержимое атрибута "alt", но в виде обычного текста, который нельзя выделить как ссылку.

source: Links
ru: Ссылки

source: Options for handling of links to other documents.
ru: Параметры для работы со ссылками на другие документы.

source: Active link
ru: Активная ссылка

source: Options for the active link.
ru: Параметры для активной ссылки.

source: Colors
ru: Цвета

source: Active link colors.
ru: Цвета для отображения активной ссылки.

source: Background color
ru: Цвет фона

source: Default background color.
ru: Цвет фона по умолчанию.

source: Text color
ru: Цвет текста

source: Default text color.
ru: Цвет текста по умолчанию.

source: Enable color
ru: Активировать цвет

source: Enable use of the active link background and text color settings instead of the link colors from the document.
ru: Использовать заданные цвета фона и текста для отображения активной ссылки вместо цвета отображения ссылки в документе.

source: Bold
ru: Жирный шрифт

source: Make the active link text bold.
ru: Выделять текст ссылки жирным шрифтом.

source: Invert colors
ru: Инвертировать цвета

source: Invert the fore- and background color so the link stands out.
ru: Инвертировать цвета текста и фона для выделения ссылки.

source: Underline
ru: Подчёркивание

source: Underline the active link.
ru: Выделять активную ссылку подчёркиванием.

source: Directory highlighting
ru: Выделение каталога

source: Highlight links to directories in FTP and local directory listing.
ru: Выделять ссылки на каталоги FTP и локальные каталоги.

source: Number links
ru: Нумерация ссылок

source: Display numbers next to the links.
ru: Отображать нумерацию рядом со ссылками.

source: Handling of target=_blank
ru: Обработка атрибута target=_blank

source: Define how to handle links having target=_blank set: 0 means open link in current tab 1 means open link in new tab in foreground 2 means open link in new tab in background 3 means open link in new window
ru: Определяет способ обработки ссылок с атрибутом target=_blank: 0 открывать ссылку на текущей вкладке 1 открывать ссылку на новой текущей вкладке 2 открывать ссылку на новой фоновой вкладке 3 открывать ссылку в новом окне

source: Use tabindex
ru: Использовать "tabindex"

source: Whether to navigate links using tabindex specified ordering. The TABINDEX attribute in HTML elements specifies the order in which links should receive focus when using the keyboard to navigate the document.
ru: Использовать порядок перехода по ссылкам, задаваемый с помощью атрибута "tabindex". Атрибут TABINDEX в элементах HTML задаёт порядок, в котором должны активироваться ссылки при переходе по документу с использованием клавиатуры.

source: Missing fragment reporting
ru: Сообщение об отсутствии фрагмента документа

source: Open a message box when document has no tag with given id.
ru: Выводить окно сообщения при отсутствии тэга с данным "id" в документе.

source: Number keys select links
ru: Выделение ссылок цифровыми клавишами

source: Number keys select links rather than specify command prefixes. This is a tristate: 0 means never 1 means if document.browse.links.numbering = 1 2 means always
ru: Выделять ссылки цифровыми клавишами вместо указания префиксов к команде. 0 никогда 1 только при document.browse.links.numbering = 1 2 всегда

source: Warn about maliciously crafted URIs
ru: Предупреждать о вредоносных URI-адресах

source: When following a link the user ID part of the URI is checked and if a maliciously crafted URI is detected a warning dialog will ask before following the link.
ru: При переходе по ссылке проверяется часть URI-адреса, содержащаяидентификатор пользователя, и в случае обнаружения вредоносного URI-адреса для подтверждения перехода по ссылке выводится предупреждение.

source: Wrap-around links cycling
ru: Зацикливание перехода по ссылкам

source: When pressing 'down' on the last link, jump to the first one, and vice versa.
ru: При нажатии клавиши "Down" на последней ссылке выполняетсяпереход на первую и наоборот.

source: Scrolling
ru: Прокрутка

source: Scrolling options.
ru: Параметры прокрутки.

source: Horizontal step
ru: Шаг горизонтальной прокрутки

source: Number of columns to scroll when a key bound to scroll-left or scroll-right is pressed and no prefix was given.
ru: Число прокручиваемых столбцов при нажатии клавиши горизонтальной прокрутки влево или вправо без указания префикса.

source: Extended horizontal scrolling
ru: Горизонтальная прокрутка за пределы экрана

source: Whether to allow horizontal scrolling when the document does not extend off the screen. Useful for copy/paste operations.
ru: Разрешать горизонтальную прокрутку, когда документ не выходит за пределы экрана. Полезно для операций копирования/вставки.

source: Margin
ru: Поле прокрутки

source: Size of the virtual margin - when you click inside of that margin, document scrolls in that direction.
ru: Размер виртуального поля прокрутки - щелчок в области полявызывает прокрутку документа в его направлении.

source: Vertical step
ru: Вертикальный шаг

source: Number of lines to scroll when a key bound to scroll-up or scroll-down is pressed and no prefix was given.
ru: Число прокручиваемых строк при нажатии клавиши вертикальной прокрутки вверх или вниз без указания префикса.

source: Searching
ru: Поиск

source: Options for searching.
ru: Параметры поиска.

source: Case sensitivity
ru: Чувствительность к регистру

source: Whether the search should match the document text while maintaining case sensitivity.
ru: Выполнять поиск по тексту документа с учётом чувствительности к регистру.

source: Regular expressions
ru: Регулярные выражения

source: Enable searching with regular expressions: 0 for plain text searching 1 for basic regular expression searches 2 for extended regular expression searches
ru: Включить поиск по регулярным выражениям: 0 простой текстовый поиск 1 поиск по базовым регулярным выражениям 2 поиск по расширенным регулярным выражениям

source: Show search hit top or bottom dialogs
ru: Отображение окна поиска в начале или конце документа

source: Whether to show a dialog when the search hits the top or bottom of the document.
ru: Отображать диалоговое окно при достижении поиском конца или начала документа.

source: Wraparound
ru: Зацикливание

source: Wrap around when searching. Currently only used for typeahead.
ru: Зациклить поиск. В настоящий момент используется только для упреждающего поиска.

source: Show not found
ru: Информирование при отсутствии совпадений

source: How to inform the user when nothing is matched: 0 means do nothing 1 means beep the terminal 2 means pop up message box
ru: Метод информирования пользователя при отсутствии совпадений: 0 ничего не делать 1 издавать звуковой сигнал в терминале 2 выводить окно сообщения

source: Typeahead searching
ru: Упреждающий поиск

source: Start typeahead searching when an unbound key is pressed without any modifiers. Note that most keys have default bindings, so this feature will not be useful unless you unbind them. 0 disables this feature; typeahead searching will only be used when you press a key bound to search-typeahead or similar 1 automatically starts typeahead searching thru link text 2 automatically starts typeahead searching thru all document text
ru: Начинать упреждающий поиск при нажатии свободной клавиши (которой не назначено какое-либо действие) без участия клавиш-модификаторов. Важно иметь в виду, что по умолчанию почти всем клавишам назначается какое-либо действие, поэтому данная функция будет полезна лишь в случае отменены этих назначений. 0 отключение данной функции; упреждающий поиск будет осуществляться только при нажатии клавиши, назначенной для упреждающего поиска или подобной 1 автоматически начинать упреждающий поиск по тексту ссылок 2 автоматически начинать упреждающий поиск по тексту всего документа

source: Horizontal text margin
ru: Горизонтальное поле текста

source: Horizontal text margin.
ru: Горизонтальное поле текста.

source: Document meta refresh
ru: Обновление мета-данных документа

source: Automatically follow document-specified refresh directives ('<meta> refresh' tags). Web-page authors use these to instruct the browser to reload a document at a given interval or to load another page. Regardless of the value the refresh URI is accessible as a link. Use the document.browse.minimum_refresh_time to control the minimum number of seconds a refresh will wait.
ru: Автоматически следовать предписаниям по обновлению документа (в тэгах "<meta> refresh"). Разработчики веб-страниц используют эти тэги для передачи браузерам указаний по обновлению документа в заданные интервалы времени или загрузки другой страницы. Независимо от значения этого параметра URI-адрес для обновления страницы доступен в виде ссылки. С помощью параметра document.browse.minimum_refresh_time можно регулировать минимальное количество секунд задержки перед выполнением обновления.

source: Document meta refresh minimum time
ru: Минимальное время задержки перед обновлением документа

source: The minimum number of milliseconds that should pass before refreshing. If set to zero the document refresh time is used unchanged. It can fix going back in history for some sites that use refreshing with zero values.
ru: Минимальное время задержки в миллисекундах перед обновлением документа. Значение "0" оставляет время обновления без изменения. Этот параметр позволяет исправить поведение при обратном переходе в историю просмотра страниц на некоторых сайтах, где для обновления заданы нулевые значения.

source: Tables navigation order
ru: Порядок перехода по таблицам

source: Move by columns in table, instead of rows.
ru: Переход по столбцам в таблице, вместо строк.

source: Cache
ru: Кэш

source: Cache options.
ru: Параметры кэша

source: Cache information about redirects
ru: Кэшировать информацию по перенаправлениям

source: Cache even redirects sent by server (usually thru HTTP by a 302 HTTP code and a Location header). This was the original behaviour for quite some time, but it causes problems in a situation very common to various web login systems - frequently, when accessing a certain location, they will redirect you to a login page if they don't receive an auth cookie, the login page then gives you the cookie and redirects you back to the original page, but there you have already cached redirect back to the login page! If this option has value of 0, this malfunction is fixed, but occasionally you may get superfluous (depends on how you take it ;-) requests to the server. If this option has value of 1, experienced users can still workaround it by clever combination of usage of reload, jumping around in session history and hitting ctrl+enter. Note that this option is checked when retrieving the information from cache, not when saving it to cache - thus if you enable it, even previous redirects will be taken from cache instead of asking the server.
ru: Сохранение в кэш отправляемых сервером перенаправлений (обычно в виде ответа по протоколу HTTP с кодом состояния 302 и заголовком "Location"). Такие перенаправления довольно долго повсеместно практиковались, но в некоторых ситуациях при работе с различными системами веб-авторизации здесь могут возникать проблемы - чаще всего это происходит в случае доступа к некоторым ресурсам, где при отсутствии cookie-файла аутентификации сервер перенаправляет пользователя на страницу авторизации, а затем после получения cookie-файла на странице авторизации перенаправляет его обратно на исходную страницу, однако проблема заключается в том, что в кэше по этому адресу уже записано перенаправление на страницу авторизации! Если данный параметр имеет значение 0, то ошибка исправлена, но время от времени могут происходить избыточные (в зависимости от того, как к этому относиться ;-) обращения к серверу. Если параметр имеет значение 1, то опытные пользователи могут обходить эту проблему, применяя хитрую комбинацию перезагрузки, перемещения по истории сеансов и нажатия ctrl+enter. Важно понимать, что данный параметр действует при получении информации из кэша, а не при сохранении её в кэш, поэтому включение параметра приведёт к тому, что даже предыдущие перенаправления будут загружаться из кэша вместо отправки запроса на сервер.

source: Ignore cache-control info from server
ru: Игнорирование содержимого заголовка "cache-control" в ответах сервера

source: Ignore Cache-Control and Pragma server headers. When set, the document is cached even with 'Cache-Control: no-cache'.
ru: Игнорирование заголовков "Cache-Control" и "Pragma" в ответах сервера. При включении параметра документ сохраняется в кэше даже при получении ответа с заголовком "Cache-Control: no-cache".

source: Formatted documents
ru: Кэш форматированных документов

source: Format cache options.
ru: Параметры кэша форматированных документов.

source: Number
ru: Количество

source: Number of cached formatted pages. Do not get too generous here, 'formatted' means that all the accompanying structures are kept in memory so that you get the cached document immediatelly, but these structures may take a lot - 2x the size of the HTML source is probably not unusual, but it can be even more if the document consists of a lot of short lines (padded right, if possible) and links and not much other markup. So if you set this to 256 and then you don't like your ELinks eating 90M, don't come complaining to us. ;-) Also note that the format cache itself is not counted to the memory cache size, but the HTML source of the formatted documents is always cached, even if it is over the memory cache size threshold. (Then of course no other documents can be cached.)
ru: Количество отформатированных страниц в кэше. Не стоит проявлять здесь чрезмерную щедрость, так как "форматированный" означает, что все сопутствующие структуры сохраняются в памяти, чтобы можно было сразу вывести кэшированный документ, и эти структуры могут занимать немалый размер - обычно это в два раза больше, чем исходный код HTML, однако и это не предел, особенно когда документ состоит из большого количества коротких строк (по возможности дополненных вправо) и ссылок, а также умеренного количества другой разметки. Поэтому, если пользователь установит здесь значение 256 и будет испытывать неудовольствие от того, что ELinks потребляет 90Мб, то не нужно обвинять в этом нас. ;-) Также нужно иметь в виду, что хотя кэш форматированного документа и не причисляется к размеру кэша памяти, исходный код HTML форматированных документов всегда кэшируется, даже если при этом превышается порог кэша. (В этом случае другие документы записать в кэш будет уже невозможно.)

source: Revalidation interval
ru: Интервал проверки актуальности

source: Period in seconds that a cache entry is considered to be up-to-date. When a document is loaded and this interval has elapsed since the document was initially loaded or most recently revalidated with the server, the server will be checked in case there is a more up-to-date version of the document. A value of -1 disables automatic revalidation.
ru: Период в секундах, в течение которых запись кэша считается актуальной. После загрузки документа при истечении данного интервала времени смомента первоначальной загрузки или после самого последнего обновления с сервера, будет проведена проверка на наличие на сервере более свежей версии документа. Значение -1 отключает автоматическую проверку актуальности.

source: Memory cache
ru: Кэш памяти

source: Memory cache options.
ru: Параметры кэша памяти.

source: Memory cache size (in bytes).
ru: Размер кэша памяти (в байтах).

source: Charset
ru: Кодировка

source: Charset options.
ru: Параметры кодировки.

source: Default codepage
ru: Кодовая страница по умолчанию

source: Default document codepage. 'System' stands for a codepage determined by a selected locale.
ru: Кодовая страница документа по умолчанию. Параметр "Система" означает, что кодовая страница определяется по текущим настройкам языка системы.

source: Ignore charset info from server
ru: Игнорировать информацию о кодировке с сервера

source: Ignore charset info sent by server.
ru: Игнорировать информацию о кодировке документа, отправляемой сервером.

source: Default color settings
ru: Настройка цвета по умолчнию

source: Default document color settings.
ru: Настройка цвета документа по умолчанию.

source: Link color
ru: Цвет ссылки

source: Default link color.
ru: Цвет ссылки по умолчанию.

source: Visited-link color
ru: Цвет просмотренной ссылки

source: Default visited link color.
ru: Цвет просмотренной ссылки по умолчанию.

source: Image-link color
ru: Цвет ссылки на изображение

source: Default image link color.
ru: Цвет ссылки на изображение по умолчанию.
